garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f54q71.h
// Register: DMAnCON1
#define DMAnCON1 DMAnCON1
extern volatile unsigned char           DMAnCON1            __at(0x0FD);
#ifndef _LIB_BUILD
asm("DMAnCON1 equ 0FDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSTP                   :1;
        unsigned SMODE                  :2;
        unsigned SMR                    :2;
        unsigned DSTP                   :1;
        unsigned DMODE                  :2;
    };
} DMAnCON1bits_t;
extern volatile DMAnCON1bits_t DMAnCON1bits __at(0x0FD);
// bitfield macros
#define _DMAnCON1_SSTP_POSN                                 0x0
#define _DMAnCON1_SSTP_POSITION                             0x0
#define _DMAnCON1_SSTP_SIZE                                 0x1
#define _DMAnCON1_SSTP_LENGTH                               0x1
#define _DMAnCON1_SSTP_MASK                                 0x1
#define _DMAnCON1_SMODE_POSN                                0x1
#define _DMAnCON1_SMODE_POSITION                            0x1
#define _DMAnCON1_SMODE_SIZE                                0x2
#define _DMAnCON1_SMODE_LENGTH                              0x2
#define _DMAnCON1_SMODE_MASK                                0x6
#define _DMAnCON1_SMR_POSN                                  0x3
#define _DMAnCON1_SMR_POSITION                              0x3
#define _DMAnCON1_SMR_SIZE                                  0x2
#define _DMAnCON1_SMR_LENGTH                                0x2
#define _DMAnCON1_SMR_MASK                                  0x18
#define _DMAnCON1_DSTP_POSN                                 0x5
#define _DMAnCON1_DSTP_POSITION                             0x5
#define _DMAnCON1_DSTP_SIZE                                 0x1
#define _DMAnCON1_DSTP_LENGTH                               0x1
#define _DMAnCON1_DSTP_MASK                                 0x20
#define _DMAnCON1_DMODE_POSN                                0x6
#define _DMAnCON1_DMODE_POSITION                            0x6
#define _DMAnCON1_DMODE_SIZE                                0x2
#define _DMAnCON1_DMODE_LENGTH                              0x2
#define _DMAnCON1_DMODE_MASK                                0xC0

// Register: DMAnAIRQ
#define DMAnAIRQ DMAnAIRQ
extern volatile unsigned char           DMAnAIRQ            __at(0x0FE);
#ifndef _LIB_BUILD
asm("DMAnAIRQ equ 0FEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AIRQ                   :8;
    };
    struct {
        unsigned AIRQ0                  :1;
        unsigned AIRQ1                  :1;
        unsigned AIRQ2                  :1;
        unsigned AIRQ3                  :1;
        unsigned AIRQ4                  :1;
        unsigned AIRQ5                  :1;
        unsigned AIRQ6                  :1;
        unsigned AIRQ7                  :1;
    };
} DMAnAIRQbits_t;
extern volatile DMAnAIRQbits_t DMAnAIRQbits __at(0x0FE);
// bitfield macros
#define _DMAnAIRQ_AIRQ_POSN                                 0x0
#define _DMAnAIRQ_AIRQ_POSITION                             0x0
#define _DMAnAIRQ_AIRQ_SIZE                                 0x8
#define _DMAnAIRQ_AIRQ_LENGTH                               0x8
#define _DMAnAIRQ_AIRQ_MASK                                 0xFF
#define _DMAnAIRQ_AIRQ0_POSN                                0x0
#define _DMAnAIRQ_AIRQ0_POSITION                            0x0
#define _DMAnAIRQ_AIRQ0_SIZE                                0x1
#define _DMAnAIRQ_AIRQ0_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ0_MASK                                0x1
#define _DMAnAIRQ_AIRQ1_POSN                                0x1
#define _DMAnAIRQ_AIRQ1_POSITION                            0x1
#define _DMAnAIRQ_AIRQ1_SIZE                                0x1
#define _DMAnAIRQ_AIRQ1_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ1_MASK                                0x2
#define _DMAnAIRQ_AIRQ2_POSN                                0x2
#define _DMAnAIRQ_AIRQ2_POSITION                            0x2
#define _DMAnAIRQ_AIRQ2_SIZE                                0x1
#define _DMAnAIRQ_AIRQ2_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ2_MASK                                0x4
#define _DMAnAIRQ_AIRQ3_POSN                                0x3
#define _DMAnAIRQ_AIRQ3_POSITION                            0x3
#define _DMAnAIRQ_AIRQ3_SIZE                                0x1
#define _DMAnAIRQ_AIRQ3_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ3_MASK                                0x8
#define _DMAnAIRQ_AIRQ4_POSN                                0x4
#define _DMAnAIRQ_AIRQ4_POSITION                            0x4
#define _DMAnAIRQ_AIRQ4_SIZE                                0x1
#define _DMAnAIRQ_AIRQ4_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ4_MASK                                0x10
#define _DMAnAIRQ_AIRQ5_POSN                                0x5
#define _DMAnAIRQ_AIRQ5_POSITION                            0x5
#define _DMAnAIRQ_AIRQ5_SIZE                                0x1
#define _DMAnAIRQ_AIRQ5_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ5_MASK                                0x20
#define _DMAnAIRQ_AIRQ6_POSN                                0x6
#define _DMAnAIRQ_AIRQ6_POSITION                            0x6
#define _DMAnAIRQ_AIRQ6_SIZE                                0x1
#define _DMAnAIRQ_AIRQ6_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ6_MASK                                0x40
#define _DMAnAIRQ_AIRQ7_POSN                                0x7
#define _DMAnAIRQ_AIRQ7_POSITION                            0x7
#define _DMAnAIRQ_AIRQ7_SIZE                                0x1
#define _DMAnAIRQ_AIRQ7_LENGTH                              0x1
#define _DMAnAIRQ_AIRQ7_MASK                                0x80

// Register: DMAnSIRQ
#define DMAnSIRQ DMAnSIRQ
extern volatile unsigned char           DMAnSIRQ            __at(0x0FF);
#ifndef _LIB_BUILD
asm("DMAnSIRQ equ 0FFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SIRQ                   :8;
    };
    struct {
        unsigned SIRQ0                  :1;
        unsigned SIRQ1                  :1;
        unsigned SIRQ2                  :1;
        unsigned SIRQ3                  :1;
        unsigned SIRQ4                  :1;
        unsigned SIRQ5                  :1;
        unsigned SIRQ6                  :1;
        unsigned SIRQ7                  :1;
    };
} DMAnSIRQbits_t;
extern volatile DMAnSIRQbits_t DMAnSIRQbits __at(0x0FF);
// bitfield macros
#define _DMAnSIRQ_SIRQ_POSN                                 0x0
#define _DMAnSIRQ_SIRQ_POSITION                             0x0
#define _DMAnSIRQ_SIRQ_SIZE                                 0x8
#define _DMAnSIRQ_SIRQ_LENGTH                               0x8
#define _DMAnSIRQ_SIRQ_MASK                                 0xFF
#define _DMAnSIRQ_SIRQ0_POSN                                0x0
#define _DMAnSIRQ_SIRQ0_POSITION                            0x0
#define _DMAnSIRQ_SIRQ0_SIZE                                0x1
#define _DMAnSIRQ_SIRQ0_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ0_MASK                                0x1
#define _DMAnSIRQ_SIRQ1_POSN                                0x1
#define _DMAnSIRQ_SIRQ1_POSITION                            0x1
#define _DMAnSIRQ_SIRQ1_SIZE                                0x1
#define _DMAnSIRQ_SIRQ1_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ1_MASK                                0x2
#define _DMAnSIRQ_SIRQ2_POSN                                0x2
#define _DMAnSIRQ_SIRQ2_POSITION                            0x2
#define _DMAnSIRQ_SIRQ2_SIZE                                0x1
#define _DMAnSIRQ_SIRQ2_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ2_MASK                                0x4
#define _DMAnSIRQ_SIRQ3_POSN                                0x3
#define _DMAnSIRQ_SIRQ3_POSITION                            0x3
#define _DMAnSIRQ_SIRQ3_SIZE                                0x1
#define _DMAnSIRQ_SIRQ3_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ3_MASK                                0x8
#define _DMAnSIRQ_SIRQ4_POSN                                0x4
#define _DMAnSIRQ_SIRQ4_POSITION                            0x4
#define _DMAnSIRQ_SIRQ4_SIZE                                0x1
#define _DMAnSIRQ_SIRQ4_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ4_MASK                                0x10
#define _DMAnSIRQ_SIRQ5_POSN                                0x5
#define _DMAnSIRQ_SIRQ5_POSITION                            0x5
#define _DMAnSIRQ_SIRQ5_SIZE                                0x1
#define _DMAnSIRQ_SIRQ5_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ5_MASK                                0x20
#define _DMAnSIRQ_SIRQ6_POSN                                0x6
#define _DMAnSIRQ_SIRQ6_POSITION                            0x6
#define _DMAnSIRQ_SIRQ6_SIZE                                0x1
#define _DMAnSIRQ_SIRQ6_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ6_MASK                                0x40
#define _DMAnSIRQ_SIRQ7_POSN                                0x7
#define _DMAnSIRQ_SIRQ7_POSITION                            0x7
#define _DMAnSIRQ_SIRQ7_SIZE                                0x1
#define _DMAnSIRQ_SIRQ7_LENGTH                              0x1
#define _DMAnSIRQ_SIRQ7_MASK                                0x80

// Register: PORTW
#define PORTW PORTW
extern volatile unsigned char           PORTW               __at(0x100);
#ifndef _LIB_BUILD
asm("PORTW equ 0100h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RW0                    :1;
        unsigned RW1                    :1;
        unsigned RW2                    :1;
        unsigned RW3                    :1;
        unsigned RW4                    :1;
        unsigned RW5                    :1;
        unsigned RW6                    :1;
        unsigned RW7                    :1;
    };
} PORTWbits_t;
extern volatile PORTWbits_t PORTWbits __at(0x100);
// bitfield macros
#define _PORTW_RW0_POSN                                     0x0
#define _PORTW_RW0_POSITION                                 0x0
#define _PORTW_RW0_SIZE                                     0x1
#define _PORTW_RW0_LENGTH                                   0x1
#define _PORTW_RW0_MASK                                     0x1
#define _PORTW_RW1_POSN                                     0x1
#define _PORTW_RW1_POSITION                                 0x1
#define _PORTW_RW1_SIZE                                     0x1
#define _PORTW_RW1_LENGTH                                   0x1
#define _PORTW_RW1_MASK                                     0x2
#define _PORTW_RW2_POSN                                     0x2
#define _PORTW_RW2_POSITION                                 0x2
#define _PORTW_RW2_SIZE                                     0x1
#define _PORTW_RW2_LENGTH                                   0x1
#define _PORTW_RW2_MASK                                     0x4
#define _PORTW_RW3_POSN                                     0x3
#define _PORTW_RW3_POSITION                                 0x3
#define _PORTW_RW3_SIZE                                     0x1
#define _PORTW_RW3_LENGTH                                   0x1
#define _PORTW_RW3_MASK                                     0x8
#define _PORTW_RW4_POSN                                     0x4
#define _PORTW_RW4_POSITION                                 0x4
#define _PORTW_RW4_SIZE                                     0x1
#define _PORTW_RW4_LENGTH                                   0x1
#define _PORTW_RW4_MASK                                     0x10
#define _PORTW_RW5_POSN                                     0x5
#define _PORTW_RW5_POSITION                                 0x5
#define _PORTW_RW5_SIZE                                     0x1
#define _PORTW_RW5_LENGTH                                   0x1
#define _PORTW_RW5_MASK                                     0x20
#define _PORTW_RW6_POSN                                     0x6
#define _PORTW_RW6_POSITION                                 0x6
#define _PORTW_RW6_SIZE                                     0x1
#define _PORTW_RW6_LENGTH                                   0x1
#define _PORTW_RW6_MASK                                     0x40
#define _PORTW_RW7_POSN                                     0x7
#define _PORTW_RW7_POSITION                                 0x7
#define _PORTW_RW7_SIZE                                     0x1
#define _PORTW_RW7_LENGTH                                   0x1
#define _PORTW_RW7_MASK                                     0x80

// Register: LATW
#define LATW LATW
extern volatile unsigned char           LATW                __at(0x101);
#ifndef _LIB_BUILD
asm("LATW equ 0101h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LATW0                  :1;
        unsigned LATW1                  :1;
        unsigned LATW2                  :1;
        unsigned LATW3                  :1;
        unsigned LATW4                  :1;
        unsigned LATW5                  :1;
        unsigned LATW6                  :1;
        unsigned LATW7                  :1;
    };
} LATWbits_t;
extern volatile LATWbits_t LATWbits __at(0x101);
// bitfield macros
#define _LATW_LATW0_POSN                                    0x0
#define _LATW_LATW0_POSITION                                0x0
#define _LATW_LATW0_SIZE                                    0x1
#define _LATW_LATW0_LENGTH                                  0x1
#define _LATW_LATW0_MASK                                    0x1
#define _LATW_LATW1_POSN                                    0x1
#define _LATW_LATW1_POSITION                                0x1
#define _LATW_LATW1_SIZE                                    0x1
#define _LATW_LATW1_LENGTH                                  0x1
#define _LATW_LATW1_MASK                                    0x2
#define _LATW_LATW2_POSN                                    0x2
#define _LATW_LATW2_POSITION                                0x2
#define _LATW_LATW2_SIZE                                    0x1
#define _LATW_LATW2_LENGTH                                  0x1
#define _LATW_LATW2_MASK                                    0x4
#define _LATW_LATW3_POSN                                    0x3
#define _LATW_LATW3_POSITION                                0x3
#define _LATW_LATW3_SIZE                                    0x1
#define _LATW_LATW3_LENGTH                                  0x1
#define _LATW_LATW3_MASK                                    0x8
#define _LATW_LATW4_POSN                                    0x4
#define _LATW_LATW4_POSITION                                0x4
#define _LATW_LATW4_SIZE                                    0x1
#define _LATW_LATW4_LENGTH                                  0x1
#define _LATW_LATW4_MASK                                    0x10
#define _LATW_LATW5_POSN                                    0x5
#define _LATW_LATW5_POSITION                                0x5
#define _LATW_LATW5_SIZE                                    0x1
#define _LATW_LATW5_LENGTH                                  0x1
#define _LATW_LATW5_MASK                                    0x20
#define _LATW_LATW6_POSN                                    0x6
#define _LATW_LATW6_POSITION                                0x6
#define _LATW_LATW6_SIZE                                    0x1
#define _LATW_LATW6_LENGTH                                  0x1
#define _LATW_LATW6_MASK                                    0x40
#define _LATW_LATW7_POSN                                    0x7
#define _LATW_LATW7_POSITION                                0x7
#define _LATW_LATW7_SIZE                                    0x1
#define _LATW_LATW7_LENGTH                                  0x1
#define _LATW_LATW7_MASK                                    0x80

// Register: PORTWIN0
#define PORTWIN0 PORTWIN0
extern volatile unsigned char           PORTWIN0            __at(0x102);
#ifndef _LIB_BUILD
asm("PORTWIN0 equ 0102h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IN                     :8;
    };
    struct {
        unsigned IN0                    :1;
        unsigned IN1                    :1;
        unsigned IN2                    :1;
        unsigned IN3                    :1;
    };
} PORTWIN0bits_t;
extern volatile PORTWIN0bits_t PORTWIN0bits __at(0x102);
// bitfield macros
#define _PORTWIN0_IN_POSN                                   0x0
#define _PORTWIN0_IN_POSITION                               0x0
#define _PORTWIN0_IN_SIZE                                   0x8
#define _PORTWIN0_IN_LENGTH                                 0x8
#define _PORTWIN0_IN_MASK                                   0xFF
#define _PORTWIN0_IN0_POSN                                  0x0
#define _PORTWIN0_IN0_POSITION                              0x0
#define _PORTWIN0_IN0_SIZE                                  0x1
#define _PORTWIN0_IN0_LENGTH                                0x1
#define _PORTWIN0_IN0_MASK                                  0x1
#define _PORTWIN0_IN1_POSN                                  0x1
#define _PORTWIN0_IN1_POSITION                              0x1
#define _PORTWIN0_IN1_SIZE                                  0x1
#define _PORTWIN0_IN1_LENGTH                                0x1
#define _PORTWIN0_IN1_MASK                                  0x2
#define _PORTWIN0_IN2_POSN                                  0x2
#define _PORTWIN0_IN2_POSITION                              0x2
#define _PORTWIN0_IN2_SIZE                                  0x1
#define _PORTWIN0_IN2_LENGTH                                0x1
#define _PORTWIN0_IN2_MASK                                  0x4
#define _PORTWIN0_IN3_POSN                                  0x3
#define _PORTWIN0_IN3_POSITION                              0x3
#define _PORTWIN0_IN3_SIZE                                  0x1
#define _PORTWIN0_IN3_LENGTH                                0x1
#define _PORTWIN0_IN3_MASK                                  0x8

