garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f54q71.h
// Register: APMPERL
#define APMPERL APMPERL
extern volatile unsigned char           APMPERL             __at(0x1C3);
#ifndef _LIB_BUILD
asm("APMPERL equ 01C3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PER                    :8;
    };
    struct {
        unsigned PER0                   :1;
        unsigned PER1                   :1;
        unsigned PER2                   :1;
        unsigned PER3                   :1;
        unsigned PER4                   :1;
        unsigned PER5                   :1;
        unsigned PER6                   :1;
        unsigned PER7                   :1;
    };
    struct {
        unsigned APMPER                 :8;
    };
    struct {
        unsigned APMPER0                :1;
        unsigned APMPER1                :1;
        unsigned APMPER2                :1;
        unsigned APMPER3                :1;
        unsigned APMPER4                :1;
        unsigned APMPER5                :1;
        unsigned APMPER6                :1;
        unsigned APMPER7                :1;
    };
} APMPERLbits_t;
extern volatile APMPERLbits_t APMPERLbits __at(0x1C3);
// bitfield macros
#define _APMPERL_PER_POSN                                   0x0
#define _APMPERL_PER_POSITION                               0x0
#define _APMPERL_PER_SIZE                                   0x8
#define _APMPERL_PER_LENGTH                                 0x8
#define _APMPERL_PER_MASK                                   0xFF
#define _APMPERL_PER0_POSN                                  0x0
#define _APMPERL_PER0_POSITION                              0x0
#define _APMPERL_PER0_SIZE                                  0x1
#define _APMPERL_PER0_LENGTH                                0x1
#define _APMPERL_PER0_MASK                                  0x1
#define _APMPERL_PER1_POSN                                  0x1
#define _APMPERL_PER1_POSITION                              0x1
#define _APMPERL_PER1_SIZE                                  0x1
#define _APMPERL_PER1_LENGTH                                0x1
#define _APMPERL_PER1_MASK                                  0x2
#define _APMPERL_PER2_POSN                                  0x2
#define _APMPERL_PER2_POSITION                              0x2
#define _APMPERL_PER2_SIZE                                  0x1
#define _APMPERL_PER2_LENGTH                                0x1
#define _APMPERL_PER2_MASK                                  0x4
#define _APMPERL_PER3_POSN                                  0x3
#define _APMPERL_PER3_POSITION                              0x3
#define _APMPERL_PER3_SIZE                                  0x1
#define _APMPERL_PER3_LENGTH                                0x1
#define _APMPERL_PER3_MASK                                  0x8
#define _APMPERL_PER4_POSN                                  0x4
#define _APMPERL_PER4_POSITION                              0x4
#define _APMPERL_PER4_SIZE                                  0x1
#define _APMPERL_PER4_LENGTH                                0x1
#define _APMPERL_PER4_MASK                                  0x10
#define _APMPERL_PER5_POSN                                  0x5
#define _APMPERL_PER5_POSITION                              0x5
#define _APMPERL_PER5_SIZE                                  0x1
#define _APMPERL_PER5_LENGTH                                0x1
#define _APMPERL_PER5_MASK                                  0x20
#define _APMPERL_PER6_POSN                                  0x6
#define _APMPERL_PER6_POSITION                              0x6
#define _APMPERL_PER6_SIZE                                  0x1
#define _APMPERL_PER6_LENGTH                                0x1
#define _APMPERL_PER6_MASK                                  0x40
#define _APMPERL_PER7_POSN                                  0x7
#define _APMPERL_PER7_POSITION                              0x7
#define _APMPERL_PER7_SIZE                                  0x1
#define _APMPERL_PER7_LENGTH                                0x1
#define _APMPERL_PER7_MASK                                  0x80
#define _APMPERL_APMPER_POSN                                0x0
#define _APMPERL_APMPER_POSITION                            0x0
#define _APMPERL_APMPER_SIZE                                0x8
#define _APMPERL_APMPER_LENGTH                              0x8
#define _APMPERL_APMPER_MASK                                0xFF
#define _APMPERL_APMPER0_POSN                               0x0
#define _APMPERL_APMPER0_POSITION                           0x0
#define _APMPERL_APMPER0_SIZE                               0x1
#define _APMPERL_APMPER0_LENGTH                             0x1
#define _APMPERL_APMPER0_MASK                               0x1
#define _APMPERL_APMPER1_POSN                               0x1
#define _APMPERL_APMPER1_POSITION                           0x1
#define _APMPERL_APMPER1_SIZE                               0x1
#define _APMPERL_APMPER1_LENGTH                             0x1
#define _APMPERL_APMPER1_MASK                               0x2
#define _APMPERL_APMPER2_POSN                               0x2
#define _APMPERL_APMPER2_POSITION                           0x2
#define _APMPERL_APMPER2_SIZE                               0x1
#define _APMPERL_APMPER2_LENGTH                             0x1
#define _APMPERL_APMPER2_MASK                               0x4
#define _APMPERL_APMPER3_POSN                               0x3
#define _APMPERL_APMPER3_POSITION                           0x3
#define _APMPERL_APMPER3_SIZE                               0x1
#define _APMPERL_APMPER3_LENGTH                             0x1
#define _APMPERL_APMPER3_MASK                               0x8
#define _APMPERL_APMPER4_POSN                               0x4
#define _APMPERL_APMPER4_POSITION                           0x4
#define _APMPERL_APMPER4_SIZE                               0x1
#define _APMPERL_APMPER4_LENGTH                             0x1
#define _APMPERL_APMPER4_MASK                               0x10
#define _APMPERL_APMPER5_POSN                               0x5
#define _APMPERL_APMPER5_POSITION                           0x5
#define _APMPERL_APMPER5_SIZE                               0x1
#define _APMPERL_APMPER5_LENGTH                             0x1
#define _APMPERL_APMPER5_MASK                               0x20
#define _APMPERL_APMPER6_POSN                               0x6
#define _APMPERL_APMPER6_POSITION                           0x6
#define _APMPERL_APMPER6_SIZE                               0x1
#define _APMPERL_APMPER6_LENGTH                             0x1
#define _APMPERL_APMPER6_MASK                               0x40
#define _APMPERL_APMPER7_POSN                               0x7
#define _APMPERL_APMPER7_POSITION                           0x7
#define _APMPERL_APMPER7_SIZE                               0x1
#define _APMPERL_APMPER7_LENGTH                             0x1
#define _APMPERL_APMPER7_MASK                               0x80

// Register: APMPERH
#define APMPERH APMPERH
extern volatile unsigned char           APMPERH             __at(0x1C4);
#ifndef _LIB_BUILD
asm("APMPERH equ 01C4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PER                    :8;
    };
    struct {
        unsigned PER8                   :1;
        unsigned PER9                   :1;
        unsigned PER10                  :1;
        unsigned PER11                  :1;
        unsigned PER12                  :1;
        unsigned PER13                  :1;
        unsigned PER14                  :1;
        unsigned PER15                  :1;
    };
    struct {
        unsigned APMPER                 :8;
    };
    struct {
        unsigned APMPER8                :1;
        unsigned APMPER9                :1;
        unsigned APMPER10               :1;
        unsigned APMPER11               :1;
        unsigned APMPER12               :1;
        unsigned APMPER13               :1;
        unsigned APMPER14               :1;
        unsigned APMPER15               :1;
    };
} APMPERHbits_t;
extern volatile APMPERHbits_t APMPERHbits __at(0x1C4);
// bitfield macros
#define _APMPERH_PER_POSN                                   0x0
#define _APMPERH_PER_POSITION                               0x0
#define _APMPERH_PER_SIZE                                   0x8
#define _APMPERH_PER_LENGTH                                 0x8
#define _APMPERH_PER_MASK                                   0xFF
#define _APMPERH_PER8_POSN                                  0x0
#define _APMPERH_PER8_POSITION                              0x0
#define _APMPERH_PER8_SIZE                                  0x1
#define _APMPERH_PER8_LENGTH                                0x1
#define _APMPERH_PER8_MASK                                  0x1
#define _APMPERH_PER9_POSN                                  0x1
#define _APMPERH_PER9_POSITION                              0x1
#define _APMPERH_PER9_SIZE                                  0x1
#define _APMPERH_PER9_LENGTH                                0x1
#define _APMPERH_PER9_MASK                                  0x2
#define _APMPERH_PER10_POSN                                 0x2
#define _APMPERH_PER10_POSITION                             0x2
#define _APMPERH_PER10_SIZE                                 0x1
#define _APMPERH_PER10_LENGTH                               0x1
#define _APMPERH_PER10_MASK                                 0x4
#define _APMPERH_PER11_POSN                                 0x3
#define _APMPERH_PER11_POSITION                             0x3
#define _APMPERH_PER11_SIZE                                 0x1
#define _APMPERH_PER11_LENGTH                               0x1
#define _APMPERH_PER11_MASK                                 0x8
#define _APMPERH_PER12_POSN                                 0x4
#define _APMPERH_PER12_POSITION                             0x4
#define _APMPERH_PER12_SIZE                                 0x1
#define _APMPERH_PER12_LENGTH                               0x1
#define _APMPERH_PER12_MASK                                 0x10
#define _APMPERH_PER13_POSN                                 0x5
#define _APMPERH_PER13_POSITION                             0x5
#define _APMPERH_PER13_SIZE                                 0x1
#define _APMPERH_PER13_LENGTH                               0x1
#define _APMPERH_PER13_MASK                                 0x20
#define _APMPERH_PER14_POSN                                 0x6
#define _APMPERH_PER14_POSITION                             0x6
#define _APMPERH_PER14_SIZE                                 0x1
#define _APMPERH_PER14_LENGTH                               0x1
#define _APMPERH_PER14_MASK                                 0x40
#define _APMPERH_PER15_POSN                                 0x7
#define _APMPERH_PER15_POSITION                             0x7
#define _APMPERH_PER15_SIZE                                 0x1
#define _APMPERH_PER15_LENGTH                               0x1
#define _APMPERH_PER15_MASK                                 0x80
#define _APMPERH_APMPER_POSN                                0x0
#define _APMPERH_APMPER_POSITION                            0x0
#define _APMPERH_APMPER_SIZE                                0x8
#define _APMPERH_APMPER_LENGTH                              0x8
#define _APMPERH_APMPER_MASK                                0xFF
#define _APMPERH_APMPER8_POSN                               0x0
#define _APMPERH_APMPER8_POSITION                           0x0
#define _APMPERH_APMPER8_SIZE                               0x1
#define _APMPERH_APMPER8_LENGTH                             0x1
#define _APMPERH_APMPER8_MASK                               0x1
#define _APMPERH_APMPER9_POSN                               0x1
#define _APMPERH_APMPER9_POSITION                           0x1
#define _APMPERH_APMPER9_SIZE                               0x1
#define _APMPERH_APMPER9_LENGTH                             0x1
#define _APMPERH_APMPER9_MASK                               0x2
#define _APMPERH_APMPER10_POSN                              0x2
#define _APMPERH_APMPER10_POSITION                          0x2
#define _APMPERH_APMPER10_SIZE                              0x1
#define _APMPERH_APMPER10_LENGTH                            0x1
#define _APMPERH_APMPER10_MASK                              0x4
#define _APMPERH_APMPER11_POSN                              0x3
#define _APMPERH_APMPER11_POSITION                          0x3
#define _APMPERH_APMPER11_SIZE                              0x1
#define _APMPERH_APMPER11_LENGTH                            0x1
#define _APMPERH_APMPER11_MASK                              0x8
#define _APMPERH_APMPER12_POSN                              0x4
#define _APMPERH_APMPER12_POSITION                          0x4
#define _APMPERH_APMPER12_SIZE                              0x1
#define _APMPERH_APMPER12_LENGTH                            0x1
#define _APMPERH_APMPER12_MASK                              0x10
#define _APMPERH_APMPER13_POSN                              0x5
#define _APMPERH_APMPER13_POSITION                          0x5
#define _APMPERH_APMPER13_SIZE                              0x1
#define _APMPERH_APMPER13_LENGTH                            0x1
#define _APMPERH_APMPER13_MASK                              0x20
#define _APMPERH_APMPER14_POSN                              0x6
#define _APMPERH_APMPER14_POSITION                          0x6
#define _APMPERH_APMPER14_SIZE                              0x1
#define _APMPERH_APMPER14_LENGTH                            0x1
#define _APMPERH_APMPER14_MASK                              0x40
#define _APMPERH_APMPER15_POSN                              0x7
#define _APMPERH_APMPER15_POSITION                          0x7
#define _APMPERH_APMPER15_SIZE                              0x1
#define _APMPERH_APMPER15_LENGTH                            0x1
#define _APMPERH_APMPER15_MASK                              0x80

// Register: APMSTART1
#define APMSTART1 APMSTART1
extern volatile unsigned short          APMSTART1           __at(0x1C5);
#ifndef _LIB_BUILD
asm("APMSTART1 equ 01C5h");
#endif

// Register: APMSTART1L
#define APMSTART1L APMSTART1L
extern volatile unsigned char           APMSTART1L          __at(0x1C5);
#ifndef _LIB_BUILD
asm("APMSTART1L equ 01C5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned START1                 :8;
    };
} APMSTART1Lbits_t;
