garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f54q71.h
// Register: APMSTART2
#define APMSTART2 APMSTART2
#ifndef __CCI__
extern volatile __uint24                APMSTART2           __at(0x1C9);
#endif
#ifndef _LIB_BUILD
asm("APMSTART2 equ 01C9h");
#endif

// Register: APMSTART2L
#define APMSTART2L APMSTART2L
extern volatile unsigned char           APMSTART2L          __at(0x1C9);
#ifndef _LIB_BUILD
asm("APMSTART2L equ 01C9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned START2                 :8;
    };
} APMSTART2Lbits_t;
extern volatile APMSTART2Lbits_t APMSTART2Lbits __at(0x1C9);
// bitfield macros
#define _APMSTART2L_START2_POSN                             0x0
#define _APMSTART2L_START2_POSITION                         0x0
#define _APMSTART2L_START2_SIZE                             0x8
#define _APMSTART2L_START2_LENGTH                           0x8
#define _APMSTART2L_START2_MASK                             0xFF

// Register: APMSTART2H
#define APMSTART2H APMSTART2H
extern volatile unsigned char           APMSTART2H          __at(0x1CA);
#ifndef _LIB_BUILD
asm("APMSTART2H equ 01CAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned START2                 :8;
    };
} APMSTART2Hbits_t;
extern volatile APMSTART2Hbits_t APMSTART2Hbits __at(0x1CA);
// bitfield macros
#define _APMSTART2H_START2_POSN                             0x0
#define _APMSTART2H_START2_POSITION                         0x0
#define _APMSTART2H_START2_SIZE                             0x8
#define _APMSTART2H_START2_LENGTH                           0x8
#define _APMSTART2H_START2_MASK                             0xFF

// Register: APMSTART2U
#define APMSTART2U APMSTART2U
extern volatile unsigned char           APMSTART2U          __at(0x1CB);
#ifndef _LIB_BUILD
asm("APMSTART2U equ 01CBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned START2                 :8;
    };
} APMSTART2Ubits_t;
extern volatile APMSTART2Ubits_t APMSTART2Ubits __at(0x1CB);
// bitfield macros
#define _APMSTART2U_START2_POSN                             0x0
#define _APMSTART2U_START2_POSITION                         0x0
#define _APMSTART2U_START2_SIZE                             0x8
#define _APMSTART2U_START2_LENGTH                           0x8
#define _APMSTART2U_START2_MASK                             0xFF

// Register: APMPERS2
#define APMPERS2 APMPERS2
extern volatile unsigned short          APMPERS2            __at(0x1CC);
#ifndef _LIB_BUILD
asm("APMPERS2 equ 01CCh");
#endif

// Register: APMPERS2L
#define APMPERS2L APMPERS2L
extern volatile unsigned char           APMPERS2L           __at(0x1CC);
#ifndef _LIB_BUILD
asm("APMPERS2L equ 01CCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned APMPERS2               :8;
    };
    struct {
        unsigned                        :2;
        unsigned BG                     :1;
        unsigned FVR1                   :1;
        unsigned FVR2                   :1;
        unsigned ADCD                   :1;
        unsigned ADCA                   :1;
        unsigned TEMP                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned APMPERS2_2             :1;
        unsigned APMPERS2_3             :1;
        unsigned APMPERS2_4             :1;
        unsigned APMPERS2_5             :1;
        unsigned APMPERS2_6             :1;
        unsigned APMPERS2_7             :1;
    };
} APMPERS2Lbits_t;
extern volatile APMPERS2Lbits_t APMPERS2Lbits __at(0x1CC);
// bitfield macros
#define _APMPERS2L_APMPERS2_POSN                            0x0
#define _APMPERS2L_APMPERS2_POSITION                        0x0
#define _APMPERS2L_APMPERS2_SIZE                            0x8
#define _APMPERS2L_APMPERS2_LENGTH                          0x8
#define _APMPERS2L_APMPERS2_MASK                            0xFF
#define _APMPERS2L_BG_POSN                                  0x2
#define _APMPERS2L_BG_POSITION                              0x2
#define _APMPERS2L_BG_SIZE                                  0x1
#define _APMPERS2L_BG_LENGTH                                0x1
#define _APMPERS2L_BG_MASK                                  0x4
#define _APMPERS2L_FVR1_POSN                                0x3
#define _APMPERS2L_FVR1_POSITION                            0x3
#define _APMPERS2L_FVR1_SIZE                                0x1
#define _APMPERS2L_FVR1_LENGTH                              0x1
#define _APMPERS2L_FVR1_MASK                                0x8
#define _APMPERS2L_FVR2_POSN                                0x4
#define _APMPERS2L_FVR2_POSITION                            0x4
#define _APMPERS2L_FVR2_SIZE                                0x1
#define _APMPERS2L_FVR2_LENGTH                              0x1
#define _APMPERS2L_FVR2_MASK                                0x10
#define _APMPERS2L_ADCD_POSN                                0x5
#define _APMPERS2L_ADCD_POSITION                            0x5
#define _APMPERS2L_ADCD_SIZE                                0x1
#define _APMPERS2L_ADCD_LENGTH                              0x1
#define _APMPERS2L_ADCD_MASK                                0x20
#define _APMPERS2L_ADCA_POSN                                0x6
#define _APMPERS2L_ADCA_POSITION                            0x6
#define _APMPERS2L_ADCA_SIZE                                0x1
#define _APMPERS2L_ADCA_LENGTH                              0x1
#define _APMPERS2L_ADCA_MASK                                0x40
#define _APMPERS2L_TEMP_POSN                                0x7
#define _APMPERS2L_TEMP_POSITION                            0x7
#define _APMPERS2L_TEMP_SIZE                                0x1
#define _APMPERS2L_TEMP_LENGTH                              0x1
#define _APMPERS2L_TEMP_MASK                                0x80
#define _APMPERS2L_APMPERS2_2_POSN                          0x2
#define _APMPERS2L_APMPERS2_2_POSITION                      0x2
#define _APMPERS2L_APMPERS2_2_SIZE                          0x1
#define _APMPERS2L_APMPERS2_2_LENGTH                        0x1
#define _APMPERS2L_APMPERS2_2_MASK                          0x4
#define _APMPERS2L_APMPERS2_3_POSN                          0x3
#define _APMPERS2L_APMPERS2_3_POSITION                      0x3
#define _APMPERS2L_APMPERS2_3_SIZE                          0x1
#define _APMPERS2L_APMPERS2_3_LENGTH                        0x1
#define _APMPERS2L_APMPERS2_3_MASK                          0x8
#define _APMPERS2L_APMPERS2_4_POSN                          0x4
#define _APMPERS2L_APMPERS2_4_POSITION                      0x4
#define _APMPERS2L_APMPERS2_4_SIZE                          0x1
#define _APMPERS2L_APMPERS2_4_LENGTH                        0x1
#define _APMPERS2L_APMPERS2_4_MASK                          0x10
#define _APMPERS2L_APMPERS2_5_POSN                          0x5
#define _APMPERS2L_APMPERS2_5_POSITION                      0x5
#define _APMPERS2L_APMPERS2_5_SIZE                          0x1
#define _APMPERS2L_APMPERS2_5_LENGTH                        0x1
#define _APMPERS2L_APMPERS2_5_MASK                          0x20
#define _APMPERS2L_APMPERS2_6_POSN                          0x6
#define _APMPERS2L_APMPERS2_6_POSITION                      0x6
#define _APMPERS2L_APMPERS2_6_SIZE                          0x1
#define _APMPERS2L_APMPERS2_6_LENGTH                        0x1
#define _APMPERS2L_APMPERS2_6_MASK                          0x40
#define _APMPERS2L_APMPERS2_7_POSN                          0x7
#define _APMPERS2L_APMPERS2_7_POSITION                      0x7
#define _APMPERS2L_APMPERS2_7_SIZE                          0x1
#define _APMPERS2L_APMPERS2_7_LENGTH                        0x1
#define _APMPERS2L_APMPERS2_7_MASK                          0x80

// Register: APMPERS2H
#define APMPERS2H APMPERS2H
extern volatile unsigned char           APMPERS2H           __at(0x1CD);
#ifndef _LIB_BUILD
asm("APMPERS2H equ 01CDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned APMPERS2               :8;
    };
    struct {
        unsigned OPA1                   :1;
        unsigned OPA2                   :1;
        unsigned DAC1                   :1;
        unsigned DAC2                   :1;
        unsigned DAC3                   :1;
        unsigned CMP1                   :1;
        unsigned CMP2                   :1;
        unsigned ZCD                    :1;
    };
    struct {
        unsigned APMPERS2_8             :1;
        unsigned APMPERS2_9             :1;
        unsigned APMPERS2_10            :1;
        unsigned APMPERS2_11            :1;
        unsigned APMPERS2_12            :1;
        unsigned APMPERS2_13            :1;
        unsigned APMPERS2_14            :1;
        unsigned APMPERS2_15            :1;
    };
} APMPERS2Hbits_t;
extern volatile APMPERS2Hbits_t APMPERS2Hbits __at(0x1CD);
// bitfield macros
#define _APMPERS2H_APMPERS2_POSN                            0x0
#define _APMPERS2H_APMPERS2_POSITION                        0x0
#define _APMPERS2H_APMPERS2_SIZE                            0x8
#define _APMPERS2H_APMPERS2_LENGTH                          0x8
#define _APMPERS2H_APMPERS2_MASK                            0xFF
#define _APMPERS2H_OPA1_POSN                                0x0
#define _APMPERS2H_OPA1_POSITION                            0x0
#define _APMPERS2H_OPA1_SIZE                                0x1
#define _APMPERS2H_OPA1_LENGTH                              0x1
#define _APMPERS2H_OPA1_MASK                                0x1
#define _APMPERS2H_OPA2_POSN                                0x1
#define _APMPERS2H_OPA2_POSITION                            0x1
#define _APMPERS2H_OPA2_SIZE                                0x1
#define _APMPERS2H_OPA2_LENGTH                              0x1
#define _APMPERS2H_OPA2_MASK                                0x2
#define _APMPERS2H_DAC1_POSN                                0x2
#define _APMPERS2H_DAC1_POSITION                            0x2
#define _APMPERS2H_DAC1_SIZE                                0x1
#define _APMPERS2H_DAC1_LENGTH                              0x1
#define _APMPERS2H_DAC1_MASK                                0x4
#define _APMPERS2H_DAC2_POSN                                0x3
#define _APMPERS2H_DAC2_POSITION                            0x3
#define _APMPERS2H_DAC2_SIZE                                0x1
#define _APMPERS2H_DAC2_LENGTH                              0x1
#define _APMPERS2H_DAC2_MASK                                0x8
#define _APMPERS2H_DAC3_POSN                                0x4
#define _APMPERS2H_DAC3_POSITION                            0x4
#define _APMPERS2H_DAC3_SIZE                                0x1
#define _APMPERS2H_DAC3_LENGTH                              0x1
#define _APMPERS2H_DAC3_MASK                                0x10
#define _APMPERS2H_CMP1_POSN                                0x5
#define _APMPERS2H_CMP1_POSITION                            0x5
#define _APMPERS2H_CMP1_SIZE                                0x1
#define _APMPERS2H_CMP1_LENGTH                              0x1
#define _APMPERS2H_CMP1_MASK                                0x20
#define _APMPERS2H_CMP2_POSN                                0x6
#define _APMPERS2H_CMP2_POSITION                            0x6
#define _APMPERS2H_CMP2_SIZE                                0x1
#define _APMPERS2H_CMP2_LENGTH                              0x1
#define _APMPERS2H_CMP2_MASK                                0x40
#define _APMPERS2H_ZCD_POSN                                 0x7
#define _APMPERS2H_ZCD_POSITION                             0x7
#define _APMPERS2H_ZCD_SIZE                                 0x1
#define _APMPERS2H_ZCD_LENGTH                               0x1
#define _APMPERS2H_ZCD_MASK                                 0x80
#define _APMPERS2H_APMPERS2_8_POSN                          0x0
#define _APMPERS2H_APMPERS2_8_POSITION                      0x0
#define _APMPERS2H_APMPERS2_8_SIZE                          0x1
#define _APMPERS2H_APMPERS2_8_LENGTH                        0x1
#define _APMPERS2H_APMPERS2_8_MASK                          0x1
#define _APMPERS2H_APMPERS2_9_POSN                          0x1
#define _APMPERS2H_APMPERS2_9_POSITION                      0x1
#define _APMPERS2H_APMPERS2_9_SIZE                          0x1
#define _APMPERS2H_APMPERS2_9_LENGTH                        0x1
#define _APMPERS2H_APMPERS2_9_MASK                          0x2
#define _APMPERS2H_APMPERS2_10_POSN                         0x2
#define _APMPERS2H_APMPERS2_10_POSITION                     0x2
#define _APMPERS2H_APMPERS2_10_SIZE                         0x1
#define _APMPERS2H_APMPERS2_10_LENGTH                       0x1
#define _APMPERS2H_APMPERS2_10_MASK                         0x4
#define _APMPERS2H_APMPERS2_11_POSN                         0x3
#define _APMPERS2H_APMPERS2_11_POSITION                     0x3
#define _APMPERS2H_APMPERS2_11_SIZE                         0x1
#define _APMPERS2H_APMPERS2_11_LENGTH                       0x1
#define _APMPERS2H_APMPERS2_11_MASK                         0x8
#define _APMPERS2H_APMPERS2_12_POSN                         0x4
#define _APMPERS2H_APMPERS2_12_POSITION                     0x4
#define _APMPERS2H_APMPERS2_12_SIZE                         0x1
#define _APMPERS2H_APMPERS2_12_LENGTH                       0x1
#define _APMPERS2H_APMPERS2_12_MASK                         0x10
#define _APMPERS2H_APMPERS2_13_POSN                         0x5
#define _APMPERS2H_APMPERS2_13_POSITION                     0x5
#define _APMPERS2H_APMPERS2_13_SIZE                         0x1
#define _APMPERS2H_APMPERS2_13_LENGTH                       0x1
#define _APMPERS2H_APMPERS2_13_MASK                         0x20
#define _APMPERS2H_APMPERS2_14_POSN                         0x6
#define _APMPERS2H_APMPERS2_14_POSITION                     0x6
#define _APMPERS2H_APMPERS2_14_SIZE                         0x1
#define _APMPERS2H_APMPERS2_14_LENGTH                       0x1
#define _APMPERS2H_APMPERS2_14_MASK                         0x40
#define _APMPERS2H_APMPERS2_15_POSN                         0x7
#define _APMPERS2H_APMPERS2_15_POSITION                     0x7
#define _APMPERS2H_APMPERS2_15_SIZE                         0x1
#define _APMPERS2H_APMPERS2_15_LENGTH                       0x1
#define _APMPERS2H_APMPERS2_15_MASK                         0x80

// Register: APMEND1
#define APMEND1 APMEND1
#ifndef __CCI__
extern volatile __uint24                APMEND1             __at(0x1CE);
#endif
#ifndef _LIB_BUILD
asm("APMEND1 equ 01CEh");
#endif

