garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f54q71.h
extern volatile U2ERRIEbits_t U2ERRIEbits __at(0x2C6);
// bitfield macros
#define _U2ERRIE_TXCIE_POSN                                 0x0
#define _U2ERRIE_TXCIE_POSITION                             0x0
#define _U2ERRIE_TXCIE_SIZE                                 0x1
#define _U2ERRIE_TXCIE_LENGTH                               0x1
#define _U2ERRIE_TXCIE_MASK                                 0x1
#define _U2ERRIE_RXFOIE_POSN                                0x1
#define _U2ERRIE_RXFOIE_POSITION                            0x1
#define _U2ERRIE_RXFOIE_SIZE                                0x1
#define _U2ERRIE_RXFOIE_LENGTH                              0x1
#define _U2ERRIE_RXFOIE_MASK                                0x2
#define _U2ERRIE_RXBKIE_POSN                                0x2
#define _U2ERRIE_RXBKIE_POSITION                            0x2
#define _U2ERRIE_RXBKIE_SIZE                                0x1
#define _U2ERRIE_RXBKIE_LENGTH                              0x1
#define _U2ERRIE_RXBKIE_MASK                                0x4
#define _U2ERRIE_FERIE_POSN                                 0x3
#define _U2ERRIE_FERIE_POSITION                             0x3
#define _U2ERRIE_FERIE_SIZE                                 0x1
#define _U2ERRIE_FERIE_LENGTH                               0x1
#define _U2ERRIE_FERIE_MASK                                 0x8
#define _U2ERRIE_CERIE_POSN                                 0x4
#define _U2ERRIE_CERIE_POSITION                             0x4
#define _U2ERRIE_CERIE_SIZE                                 0x1
#define _U2ERRIE_CERIE_LENGTH                               0x1
#define _U2ERRIE_CERIE_MASK                                 0x10
#define _U2ERRIE_ABDOVE_POSN                                0x5
#define _U2ERRIE_ABDOVE_POSITION                            0x5
#define _U2ERRIE_ABDOVE_SIZE                                0x1
#define _U2ERRIE_ABDOVE_LENGTH                              0x1
#define _U2ERRIE_ABDOVE_MASK                                0x20
#define _U2ERRIE_PERIE_POSN                                 0x6
#define _U2ERRIE_PERIE_POSITION                             0x6
#define _U2ERRIE_PERIE_SIZE                                 0x1
#define _U2ERRIE_PERIE_LENGTH                               0x1
#define _U2ERRIE_PERIE_MASK                                 0x40
#define _U2ERRIE_TXMTIE_POSN                                0x7
#define _U2ERRIE_TXMTIE_POSITION                            0x7
#define _U2ERRIE_TXMTIE_SIZE                                0x1
#define _U2ERRIE_TXMTIE_LENGTH                              0x1
#define _U2ERRIE_TXMTIE_MASK                                0x80
#define _U2ERRIE_U2TXCIE_POSN                               0x0
#define _U2ERRIE_U2TXCIE_POSITION                           0x0
#define _U2ERRIE_U2TXCIE_SIZE                               0x1
#define _U2ERRIE_U2TXCIE_LENGTH                             0x1
#define _U2ERRIE_U2TXCIE_MASK                               0x1
#define _U2ERRIE_U2RXFOIE_POSN                              0x1
#define _U2ERRIE_U2RXFOIE_POSITION                          0x1
#define _U2ERRIE_U2RXFOIE_SIZE                              0x1
#define _U2ERRIE_U2RXFOIE_LENGTH                            0x1
#define _U2ERRIE_U2RXFOIE_MASK                              0x2
#define _U2ERRIE_U2RXBKIE_POSN                              0x2
#define _U2ERRIE_U2RXBKIE_POSITION                          0x2
#define _U2ERRIE_U2RXBKIE_SIZE                              0x1
#define _U2ERRIE_U2RXBKIE_LENGTH                            0x1
#define _U2ERRIE_U2RXBKIE_MASK                              0x4
#define _U2ERRIE_U2FERIE_POSN                               0x3
#define _U2ERRIE_U2FERIE_POSITION                           0x3
#define _U2ERRIE_U2FERIE_SIZE                               0x1
#define _U2ERRIE_U2FERIE_LENGTH                             0x1
#define _U2ERRIE_U2FERIE_MASK                               0x8
#define _U2ERRIE_U2CERIE_POSN                               0x4
#define _U2ERRIE_U2CERIE_POSITION                           0x4
#define _U2ERRIE_U2CERIE_SIZE                               0x1
#define _U2ERRIE_U2CERIE_LENGTH                             0x1
#define _U2ERRIE_U2CERIE_MASK                               0x10
#define _U2ERRIE_U2ABDOVE_POSN                              0x5
#define _U2ERRIE_U2ABDOVE_POSITION                          0x5
#define _U2ERRIE_U2ABDOVE_SIZE                              0x1
#define _U2ERRIE_U2ABDOVE_LENGTH                            0x1
#define _U2ERRIE_U2ABDOVE_MASK                              0x20
#define _U2ERRIE_U2PERIE_POSN                               0x6
#define _U2ERRIE_U2PERIE_POSITION                           0x6
#define _U2ERRIE_U2PERIE_SIZE                               0x1
#define _U2ERRIE_U2PERIE_LENGTH                             0x1
#define _U2ERRIE_U2PERIE_MASK                               0x40
#define _U2ERRIE_U2TXMTIE_POSN                              0x7
#define _U2ERRIE_U2TXMTIE_POSITION                          0x7
#define _U2ERRIE_U2TXMTIE_SIZE                              0x1
#define _U2ERRIE_U2TXMTIE_LENGTH                            0x1
#define _U2ERRIE_U2TXMTIE_MASK                              0x80

// Register: TMR1
#define TMR1 TMR1
extern volatile unsigned short          TMR1                __at(0x312);
#ifndef _LIB_BUILD
asm("TMR1 equ 0312h");
#endif

// Register: TMR1L
#define TMR1L TMR1L
extern volatile unsigned char           TMR1L               __at(0x312);
#ifndef _LIB_BUILD
asm("TMR1L equ 0312h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1L                  :8;
    };
    struct {
        unsigned TMR1L0                 :1;
        unsigned TMR1L1                 :1;
        unsigned TMR1L2                 :1;
        unsigned TMR1L3                 :1;
        unsigned TMR1L4                 :1;
        unsigned TMR1L5                 :1;
        unsigned TMR1L6                 :1;
        unsigned TMR1L7                 :1;
    };
    struct {
        unsigned TMR10                  :1;
        unsigned TMR11                  :1;
        unsigned TMR12                  :1;
        unsigned TMR13                  :1;
        unsigned TMR14                  :1;
        unsigned TMR15                  :1;
        unsigned TMR16                  :1;
        unsigned TMR17                  :1;
    };
} TMR1Lbits_t;
