garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f54q71.h
extern volatile TU16APRHbits_t TU16APRHbits __at(0x3A7);
// bitfield macros
#define _TU16APRH_PRH_POSN                                  0x0
#define _TU16APRH_PRH_POSITION                              0x0
#define _TU16APRH_PRH_SIZE                                  0x8
#define _TU16APRH_PRH_LENGTH                                0x8
#define _TU16APRH_PRH_MASK                                  0xFF
#define _TU16APRH_PRH0_POSN                                 0x0
#define _TU16APRH_PRH0_POSITION                             0x0
#define _TU16APRH_PRH0_SIZE                                 0x1
#define _TU16APRH_PRH0_LENGTH                               0x1
#define _TU16APRH_PRH0_MASK                                 0x1
#define _TU16APRH_PRH1_POSN                                 0x1
#define _TU16APRH_PRH1_POSITION                             0x1
#define _TU16APRH_PRH1_SIZE                                 0x1
#define _TU16APRH_PRH1_LENGTH                               0x1
#define _TU16APRH_PRH1_MASK                                 0x2
#define _TU16APRH_PRH2_POSN                                 0x2
#define _TU16APRH_PRH2_POSITION                             0x2
#define _TU16APRH_PRH2_SIZE                                 0x1
#define _TU16APRH_PRH2_LENGTH                               0x1
#define _TU16APRH_PRH2_MASK                                 0x4
#define _TU16APRH_PRH3_POSN                                 0x3
#define _TU16APRH_PRH3_POSITION                             0x3
#define _TU16APRH_PRH3_SIZE                                 0x1
#define _TU16APRH_PRH3_LENGTH                               0x1
#define _TU16APRH_PRH3_MASK                                 0x8
#define _TU16APRH_PRH4_POSN                                 0x4
#define _TU16APRH_PRH4_POSITION                             0x4
#define _TU16APRH_PRH4_SIZE                                 0x1
#define _TU16APRH_PRH4_LENGTH                               0x1
#define _TU16APRH_PRH4_MASK                                 0x10
#define _TU16APRH_PRH5_POSN                                 0x5
#define _TU16APRH_PRH5_POSITION                             0x5
#define _TU16APRH_PRH5_SIZE                                 0x1
#define _TU16APRH_PRH5_LENGTH                               0x1
#define _TU16APRH_PRH5_MASK                                 0x20
#define _TU16APRH_PRH6_POSN                                 0x6
#define _TU16APRH_PRH6_POSITION                             0x6
#define _TU16APRH_PRH6_SIZE                                 0x1
#define _TU16APRH_PRH6_LENGTH                               0x1
#define _TU16APRH_PRH6_MASK                                 0x40
#define _TU16APRH_PRH7_POSN                                 0x7
#define _TU16APRH_PRH7_POSITION                             0x7
#define _TU16APRH_PRH7_SIZE                                 0x1
#define _TU16APRH_PRH7_LENGTH                               0x1
#define _TU16APRH_PRH7_MASK                                 0x80
#define _TU16APRH_TU16APRH0_POSN                            0x0
#define _TU16APRH_TU16APRH0_POSITION                        0x0
#define _TU16APRH_TU16APRH0_SIZE                            0x1
#define _TU16APRH_TU16APRH0_LENGTH                          0x1
#define _TU16APRH_TU16APRH0_MASK                            0x1
#define _TU16APRH_TU16APRH1_POSN                            0x1
#define _TU16APRH_TU16APRH1_POSITION                        0x1
#define _TU16APRH_TU16APRH1_SIZE                            0x1
#define _TU16APRH_TU16APRH1_LENGTH                          0x1
#define _TU16APRH_TU16APRH1_MASK                            0x2
#define _TU16APRH_TU16APRH2_POSN                            0x2
#define _TU16APRH_TU16APRH2_POSITION                        0x2
#define _TU16APRH_TU16APRH2_SIZE                            0x1
#define _TU16APRH_TU16APRH2_LENGTH                          0x1
#define _TU16APRH_TU16APRH2_MASK                            0x4
#define _TU16APRH_TU16APRH3_POSN                            0x3
#define _TU16APRH_TU16APRH3_POSITION                        0x3
#define _TU16APRH_TU16APRH3_SIZE                            0x1
#define _TU16APRH_TU16APRH3_LENGTH                          0x1
#define _TU16APRH_TU16APRH3_MASK                            0x8
#define _TU16APRH_TU16APRH4_POSN                            0x4
#define _TU16APRH_TU16APRH4_POSITION                        0x4
#define _TU16APRH_TU16APRH4_SIZE                            0x1
#define _TU16APRH_TU16APRH4_LENGTH                          0x1
#define _TU16APRH_TU16APRH4_MASK                            0x10
#define _TU16APRH_TU16APRH5_POSN                            0x5
#define _TU16APRH_TU16APRH5_POSITION                        0x5
#define _TU16APRH_TU16APRH5_SIZE                            0x1
#define _TU16APRH_TU16APRH5_LENGTH                          0x1
#define _TU16APRH_TU16APRH5_MASK                            0x20
#define _TU16APRH_TU16APRH6_POSN                            0x6
#define _TU16APRH_TU16APRH6_POSITION                        0x6
#define _TU16APRH_TU16APRH6_SIZE                            0x1
#define _TU16APRH_TU16APRH6_LENGTH                          0x1
#define _TU16APRH_TU16APRH6_MASK                            0x40
#define _TU16APRH_TU16APRH7_POSN                            0x7
#define _TU16APRH_TU16APRH7_POSITION                        0x7
#define _TU16APRH_TU16APRH7_SIZE                            0x1
#define _TU16APRH_TU16APRH7_LENGTH                          0x1
#define _TU16APRH_TU16APRH7_MASK                            0x80
#define _TU16APRH_TU16APR8_POSN                             0x0
#define _TU16APRH_TU16APR8_POSITION                         0x0
#define _TU16APRH_TU16APR8_SIZE                             0x1
#define _TU16APRH_TU16APR8_LENGTH                           0x1
#define _TU16APRH_TU16APR8_MASK                             0x1
#define _TU16APRH_TU16APR9_POSN                             0x1
#define _TU16APRH_TU16APR9_POSITION                         0x1
#define _TU16APRH_TU16APR9_SIZE                             0x1
#define _TU16APRH_TU16APR9_LENGTH                           0x1
#define _TU16APRH_TU16APR9_MASK                             0x2
#define _TU16APRH_TU16APR10_POSN                            0x2
#define _TU16APRH_TU16APR10_POSITION                        0x2
#define _TU16APRH_TU16APR10_SIZE                            0x1
#define _TU16APRH_TU16APR10_LENGTH                          0x1
#define _TU16APRH_TU16APR10_MASK                            0x4
#define _TU16APRH_TU16APR11_POSN                            0x3
#define _TU16APRH_TU16APR11_POSITION                        0x3
#define _TU16APRH_TU16APR11_SIZE                            0x1
#define _TU16APRH_TU16APR11_LENGTH                          0x1
#define _TU16APRH_TU16APR11_MASK                            0x8
#define _TU16APRH_TU16APR12_POSN                            0x4
#define _TU16APRH_TU16APR12_POSITION                        0x4
#define _TU16APRH_TU16APR12_SIZE                            0x1
#define _TU16APRH_TU16APR12_LENGTH                          0x1
#define _TU16APRH_TU16APR12_MASK                            0x10
#define _TU16APRH_TU16APR13_POSN                            0x5
#define _TU16APRH_TU16APR13_POSITION                        0x5
#define _TU16APRH_TU16APR13_SIZE                            0x1
#define _TU16APRH_TU16APR13_LENGTH                          0x1
#define _TU16APRH_TU16APR13_MASK                            0x20
#define _TU16APRH_TU16APR14_POSN                            0x6
#define _TU16APRH_TU16APR14_POSITION                        0x6
#define _TU16APRH_TU16APR14_SIZE                            0x1
#define _TU16APRH_TU16APR14_LENGTH                          0x1
#define _TU16APRH_TU16APR14_MASK                            0x40
#define _TU16APRH_TU16APR15_POSN                            0x7
#define _TU16APRH_TU16APR15_POSITION                        0x7
#define _TU16APRH_TU16APR15_SIZE                            0x1
#define _TU16APRH_TU16APR15_LENGTH                          0x1
#define _TU16APRH_TU16APR15_MASK                            0x80

// Register: TU16ACLK
#define TU16ACLK TU16ACLK
extern volatile unsigned char           TU16ACLK            __at(0x3A8);
#ifndef _LIB_BUILD
asm("TU16ACLK equ 03A8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
        unsigned CLK4                   :1;
    };
    struct {
        unsigned TU16ACLK0              :1;
        unsigned TU16ACLK1              :1;
        unsigned TU16ACLK2              :1;
        unsigned TU16ACLK3              :1;
        unsigned TU16ACLK4              :1;
    };
} TU16ACLKbits_t;
extern volatile TU16ACLKbits_t TU16ACLKbits __at(0x3A8);
// bitfield macros
#define _TU16ACLK_CLK_POSN                                  0x0
#define _TU16ACLK_CLK_POSITION                              0x0
#define _TU16ACLK_CLK_SIZE                                  0x8
#define _TU16ACLK_CLK_LENGTH                                0x8
#define _TU16ACLK_CLK_MASK                                  0xFF
#define _TU16ACLK_CLK0_POSN                                 0x0
#define _TU16ACLK_CLK0_POSITION                             0x0
#define _TU16ACLK_CLK0_SIZE                                 0x1
#define _TU16ACLK_CLK0_LENGTH                               0x1
#define _TU16ACLK_CLK0_MASK                                 0x1
#define _TU16ACLK_CLK1_POSN                                 0x1
#define _TU16ACLK_CLK1_POSITION                             0x1
#define _TU16ACLK_CLK1_SIZE                                 0x1
#define _TU16ACLK_CLK1_LENGTH                               0x1
#define _TU16ACLK_CLK1_MASK                                 0x2
#define _TU16ACLK_CLK2_POSN                                 0x2
#define _TU16ACLK_CLK2_POSITION                             0x2
#define _TU16ACLK_CLK2_SIZE                                 0x1
#define _TU16ACLK_CLK2_LENGTH                               0x1
#define _TU16ACLK_CLK2_MASK                                 0x4
#define _TU16ACLK_CLK3_POSN                                 0x3
#define _TU16ACLK_CLK3_POSITION                             0x3
#define _TU16ACLK_CLK3_SIZE                                 0x1
#define _TU16ACLK_CLK3_LENGTH                               0x1
#define _TU16ACLK_CLK3_MASK                                 0x8
#define _TU16ACLK_CLK4_POSN                                 0x4
#define _TU16ACLK_CLK4_POSITION                             0x4
#define _TU16ACLK_CLK4_SIZE                                 0x1
#define _TU16ACLK_CLK4_LENGTH                               0x1
#define _TU16ACLK_CLK4_MASK                                 0x10
#define _TU16ACLK_TU16ACLK0_POSN                            0x0
#define _TU16ACLK_TU16ACLK0_POSITION                        0x0
#define _TU16ACLK_TU16ACLK0_SIZE                            0x1
#define _TU16ACLK_TU16ACLK0_LENGTH                          0x1
#define _TU16ACLK_TU16ACLK0_MASK                            0x1
#define _TU16ACLK_TU16ACLK1_POSN                            0x1
#define _TU16ACLK_TU16ACLK1_POSITION                        0x1
#define _TU16ACLK_TU16ACLK1_SIZE                            0x1
#define _TU16ACLK_TU16ACLK1_LENGTH                          0x1
#define _TU16ACLK_TU16ACLK1_MASK                            0x2
#define _TU16ACLK_TU16ACLK2_POSN                            0x2
#define _TU16ACLK_TU16ACLK2_POSITION                        0x2
#define _TU16ACLK_TU16ACLK2_SIZE                            0x1
#define _TU16ACLK_TU16ACLK2_LENGTH                          0x1
#define _TU16ACLK_TU16ACLK2_MASK                            0x4
#define _TU16ACLK_TU16ACLK3_POSN                            0x3
#define _TU16ACLK_TU16ACLK3_POSITION                        0x3
#define _TU16ACLK_TU16ACLK3_SIZE                            0x1
#define _TU16ACLK_TU16ACLK3_LENGTH                          0x1
#define _TU16ACLK_TU16ACLK3_MASK                            0x8
#define _TU16ACLK_TU16ACLK4_POSN                            0x4
#define _TU16ACLK_TU16ACLK4_POSITION                        0x4
#define _TU16ACLK_TU16ACLK4_SIZE                            0x1
#define _TU16ACLK_TU16ACLK4_LENGTH                          0x1
#define _TU16ACLK_TU16ACLK4_MASK                            0x10

// Register: TU16AERS
#define TU16AERS TU16AERS
extern volatile unsigned char           TU16AERS            __at(0x3A9);
#ifndef _LIB_BUILD
asm("TU16AERS equ 03A9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ERS                    :8;
    };
    struct {
        unsigned ERS0                   :1;
        unsigned ERS1                   :1;
        unsigned ERS2                   :1;
        unsigned ERS3                   :1;
        unsigned ERS4                   :1;
    };
    struct {
        unsigned TU16AERS0              :1;
        unsigned TU16AERS1              :1;
        unsigned TU16AERS2              :1;
        unsigned TU16AERS3              :1;
        unsigned TU16AERS4              :1;
    };
} TU16AERSbits_t;
extern volatile TU16AERSbits_t TU16AERSbits __at(0x3A9);
// bitfield macros
#define _TU16AERS_ERS_POSN                                  0x0
#define _TU16AERS_ERS_POSITION                              0x0
#define _TU16AERS_ERS_SIZE                                  0x8
#define _TU16AERS_ERS_LENGTH                                0x8
#define _TU16AERS_ERS_MASK                                  0xFF
#define _TU16AERS_ERS0_POSN                                 0x0
#define _TU16AERS_ERS0_POSITION                             0x0
#define _TU16AERS_ERS0_SIZE                                 0x1
#define _TU16AERS_ERS0_LENGTH                               0x1
#define _TU16AERS_ERS0_MASK                                 0x1
#define _TU16AERS_ERS1_POSN                                 0x1
#define _TU16AERS_ERS1_POSITION                             0x1
#define _TU16AERS_ERS1_SIZE                                 0x1
#define _TU16AERS_ERS1_LENGTH                               0x1
#define _TU16AERS_ERS1_MASK                                 0x2
#define _TU16AERS_ERS2_POSN                                 0x2
#define _TU16AERS_ERS2_POSITION                             0x2
#define _TU16AERS_ERS2_SIZE                                 0x1
#define _TU16AERS_ERS2_LENGTH                               0x1
#define _TU16AERS_ERS2_MASK                                 0x4
#define _TU16AERS_ERS3_POSN                                 0x3
#define _TU16AERS_ERS3_POSITION                             0x3
#define _TU16AERS_ERS3_SIZE                                 0x1
#define _TU16AERS_ERS3_LENGTH                               0x1
#define _TU16AERS_ERS3_MASK                                 0x8
#define _TU16AERS_ERS4_POSN                                 0x4
#define _TU16AERS_ERS4_POSITION                             0x4
#define _TU16AERS_ERS4_SIZE                                 0x1
#define _TU16AERS_ERS4_LENGTH                               0x1
#define _TU16AERS_ERS4_MASK                                 0x10
#define _TU16AERS_TU16AERS0_POSN                            0x0
#define _TU16AERS_TU16AERS0_POSITION                        0x0
#define _TU16AERS_TU16AERS0_SIZE                            0x1
#define _TU16AERS_TU16AERS0_LENGTH                          0x1
#define _TU16AERS_TU16AERS0_MASK                            0x1
#define _TU16AERS_TU16AERS1_POSN                            0x1
#define _TU16AERS_TU16AERS1_POSITION                        0x1
#define _TU16AERS_TU16AERS1_SIZE                            0x1
#define _TU16AERS_TU16AERS1_LENGTH                          0x1
#define _TU16AERS_TU16AERS1_MASK                            0x2
#define _TU16AERS_TU16AERS2_POSN                            0x2
#define _TU16AERS_TU16AERS2_POSITION                        0x2
#define _TU16AERS_TU16AERS2_SIZE                            0x1
#define _TU16AERS_TU16AERS2_LENGTH                          0x1
#define _TU16AERS_TU16AERS2_MASK                            0x4
#define _TU16AERS_TU16AERS3_POSN                            0x3
#define _TU16AERS_TU16AERS3_POSITION                        0x3
#define _TU16AERS_TU16AERS3_SIZE                            0x1
#define _TU16AERS_TU16AERS3_LENGTH                          0x1
#define _TU16AERS_TU16AERS3_MASK                            0x8
#define _TU16AERS_TU16AERS4_POSN                            0x4
#define _TU16AERS_TU16AERS4_POSITION                        0x4
#define _TU16AERS_TU16AERS4_SIZE                            0x1
#define _TU16AERS_TU16AERS4_LENGTH                          0x1
#define _TU16AERS_TU16AERS4_MASK                            0x10

// Register: TU16BCON0
#define TU16BCON0 TU16BCON0
extern volatile unsigned char           TU16BCON0           __at(0x3AA);
#ifndef _LIB_BUILD
asm("TU16BCON0 equ 03AAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CIE                    :1;
        unsigned ZIE                    :1;
        unsigned PRIE                   :1;
        unsigned RDSEL                  :1;
        unsigned OPOL                   :1;
        unsigned OM                     :1;
        unsigned CPOL                   :1;
        unsigned ON                     :1;
    };
    struct {
        unsigned TU16BCIE               :1;
        unsigned TU16BZIE               :1;
        unsigned TU16BPRIE              :1;
        unsigned TU16BRDSEL             :1;
        unsigned TU16BOPOL              :1;
        unsigned TU16BOM                :1;
        unsigned TU16BCPOL              :1;
        unsigned TU16BON                :1;
    };
} TU16BCON0bits_t;
