garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f54q71.h
// Register: TU16BHLT
#define TU16BHLT TU16BHLT
extern volatile unsigned char           TU16BHLT            __at(0x3AC);
#ifndef _LIB_BUILD
asm("TU16BHLT equ 03ACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STOP                   :2;
        unsigned RESET                  :2;
        unsigned START                  :2;
        unsigned CSYNC                  :1;
        unsigned EPOL                   :1;
    };
    struct {
        unsigned STOP0                  :1;
        unsigned STOP1                  :1;
        unsigned RESET0                 :1;
        unsigned RESET1                 :1;
        unsigned START0                 :1;
        unsigned START1                 :1;
    };
    struct {
        unsigned TU16BSTOP              :2;
        unsigned TU16BRESET             :2;
        unsigned TU16BSTART             :2;
        unsigned TU16BCSYNC             :1;
        unsigned TU16BEPOL              :1;
    };
    struct {
        unsigned TU16BSTOP0             :1;
        unsigned TU16BSTOP1             :1;
        unsigned TU16BRESET0            :1;
        unsigned TU16BRESET1            :1;
        unsigned TU16BSTART0            :1;
        unsigned TU16BSTART1            :1;
    };
} TU16BHLTbits_t;
extern volatile TU16BHLTbits_t TU16BHLTbits __at(0x3AC);
// bitfield macros
#define _TU16BHLT_STOP_POSN                                 0x0
#define _TU16BHLT_STOP_POSITION                             0x0
#define _TU16BHLT_STOP_SIZE                                 0x2
#define _TU16BHLT_STOP_LENGTH                               0x2
#define _TU16BHLT_STOP_MASK                                 0x3
#define _TU16BHLT_RESET_POSN                                0x2
#define _TU16BHLT_RESET_POSITION                            0x2
#define _TU16BHLT_RESET_SIZE                                0x2
#define _TU16BHLT_RESET_LENGTH                              0x2
#define _TU16BHLT_RESET_MASK                                0xC
#define _TU16BHLT_START_POSN                                0x4
#define _TU16BHLT_START_POSITION                            0x4
#define _TU16BHLT_START_SIZE                                0x2
#define _TU16BHLT_START_LENGTH                              0x2
#define _TU16BHLT_START_MASK                                0x30
#define _TU16BHLT_CSYNC_POSN                                0x6
#define _TU16BHLT_CSYNC_POSITION                            0x6
#define _TU16BHLT_CSYNC_SIZE                                0x1
#define _TU16BHLT_CSYNC_LENGTH                              0x1
#define _TU16BHLT_CSYNC_MASK                                0x40
#define _TU16BHLT_EPOL_POSN                                 0x7
#define _TU16BHLT_EPOL_POSITION                             0x7
#define _TU16BHLT_EPOL_SIZE                                 0x1
#define _TU16BHLT_EPOL_LENGTH                               0x1
#define _TU16BHLT_EPOL_MASK                                 0x80
#define _TU16BHLT_STOP0_POSN                                0x0
#define _TU16BHLT_STOP0_POSITION                            0x0
#define _TU16BHLT_STOP0_SIZE                                0x1
#define _TU16BHLT_STOP0_LENGTH                              0x1
#define _TU16BHLT_STOP0_MASK                                0x1
#define _TU16BHLT_STOP1_POSN                                0x1
#define _TU16BHLT_STOP1_POSITION                            0x1
#define _TU16BHLT_STOP1_SIZE                                0x1
#define _TU16BHLT_STOP1_LENGTH                              0x1
#define _TU16BHLT_STOP1_MASK                                0x2
#define _TU16BHLT_RESET0_POSN                               0x2
#define _TU16BHLT_RESET0_POSITION                           0x2
#define _TU16BHLT_RESET0_SIZE                               0x1
#define _TU16BHLT_RESET0_LENGTH                             0x1
#define _TU16BHLT_RESET0_MASK                               0x4
#define _TU16BHLT_RESET1_POSN                               0x3
#define _TU16BHLT_RESET1_POSITION                           0x3
#define _TU16BHLT_RESET1_SIZE                               0x1
#define _TU16BHLT_RESET1_LENGTH                             0x1
#define _TU16BHLT_RESET1_MASK                               0x8
#define _TU16BHLT_START0_POSN                               0x4
#define _TU16BHLT_START0_POSITION                           0x4
#define _TU16BHLT_START0_SIZE                               0x1
#define _TU16BHLT_START0_LENGTH                             0x1
#define _TU16BHLT_START0_MASK                               0x10
#define _TU16BHLT_START1_POSN                               0x5
#define _TU16BHLT_START1_POSITION                           0x5
#define _TU16BHLT_START1_SIZE                               0x1
#define _TU16BHLT_START1_LENGTH                             0x1
#define _TU16BHLT_START1_MASK                               0x20
#define _TU16BHLT_TU16BSTOP_POSN                            0x0
#define _TU16BHLT_TU16BSTOP_POSITION                        0x0
#define _TU16BHLT_TU16BSTOP_SIZE                            0x2
#define _TU16BHLT_TU16BSTOP_LENGTH                          0x2
#define _TU16BHLT_TU16BSTOP_MASK                            0x3
#define _TU16BHLT_TU16BRESET_POSN                           0x2
#define _TU16BHLT_TU16BRESET_POSITION                       0x2
#define _TU16BHLT_TU16BRESET_SIZE                           0x2
#define _TU16BHLT_TU16BRESET_LENGTH                         0x2
#define _TU16BHLT_TU16BRESET_MASK                           0xC
#define _TU16BHLT_TU16BSTART_POSN                           0x4
#define _TU16BHLT_TU16BSTART_POSITION                       0x4
#define _TU16BHLT_TU16BSTART_SIZE                           0x2
#define _TU16BHLT_TU16BSTART_LENGTH                         0x2
#define _TU16BHLT_TU16BSTART_MASK                           0x30
#define _TU16BHLT_TU16BCSYNC_POSN                           0x6
#define _TU16BHLT_TU16BCSYNC_POSITION                       0x6
#define _TU16BHLT_TU16BCSYNC_SIZE                           0x1
#define _TU16BHLT_TU16BCSYNC_LENGTH                         0x1
#define _TU16BHLT_TU16BCSYNC_MASK                           0x40
#define _TU16BHLT_TU16BEPOL_POSN                            0x7
#define _TU16BHLT_TU16BEPOL_POSITION                        0x7
#define _TU16BHLT_TU16BEPOL_SIZE                            0x1
#define _TU16BHLT_TU16BEPOL_LENGTH                          0x1
#define _TU16BHLT_TU16BEPOL_MASK                            0x80
#define _TU16BHLT_TU16BSTOP0_POSN                           0x0
#define _TU16BHLT_TU16BSTOP0_POSITION                       0x0
#define _TU16BHLT_TU16BSTOP0_SIZE                           0x1
#define _TU16BHLT_TU16BSTOP0_LENGTH                         0x1
#define _TU16BHLT_TU16BSTOP0_MASK                           0x1
#define _TU16BHLT_TU16BSTOP1_POSN                           0x1
#define _TU16BHLT_TU16BSTOP1_POSITION                       0x1
#define _TU16BHLT_TU16BSTOP1_SIZE                           0x1
#define _TU16BHLT_TU16BSTOP1_LENGTH                         0x1
#define _TU16BHLT_TU16BSTOP1_MASK                           0x2
#define _TU16BHLT_TU16BRESET0_POSN                          0x2
#define _TU16BHLT_TU16BRESET0_POSITION                      0x2
#define _TU16BHLT_TU16BRESET0_SIZE                          0x1
#define _TU16BHLT_TU16BRESET0_LENGTH                        0x1
#define _TU16BHLT_TU16BRESET0_MASK                          0x4
#define _TU16BHLT_TU16BRESET1_POSN                          0x3
#define _TU16BHLT_TU16BRESET1_POSITION                      0x3
#define _TU16BHLT_TU16BRESET1_SIZE                          0x1
#define _TU16BHLT_TU16BRESET1_LENGTH                        0x1
#define _TU16BHLT_TU16BRESET1_MASK                          0x8
#define _TU16BHLT_TU16BSTART0_POSN                          0x4
#define _TU16BHLT_TU16BSTART0_POSITION                      0x4
#define _TU16BHLT_TU16BSTART0_SIZE                          0x1
#define _TU16BHLT_TU16BSTART0_LENGTH                        0x1
#define _TU16BHLT_TU16BSTART0_MASK                          0x10
#define _TU16BHLT_TU16BSTART1_POSN                          0x5
#define _TU16BHLT_TU16BSTART1_POSITION                      0x5
#define _TU16BHLT_TU16BSTART1_SIZE                          0x1
#define _TU16BHLT_TU16BSTART1_LENGTH                        0x1
#define _TU16BHLT_TU16BSTART1_MASK                          0x20

// Register: TU16BPS
#define TU16BPS TU16BPS
extern volatile unsigned char           TU16BPS             __at(0x3AD);
#ifndef _LIB_BUILD
asm("TU16BPS equ 03ADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PS                     :8;
    };
    struct {
        unsigned PS0                    :1;
        unsigned PS1                    :1;
        unsigned PS2                    :1;
        unsigned PS3                    :1;
        unsigned PS4                    :1;
        unsigned PS5                    :1;
        unsigned PS6                    :1;
        unsigned PS7                    :1;
    };
    struct {
        unsigned TU16BPS0               :1;
        unsigned TU16BPS1               :1;
        unsigned TU16BPS2               :1;
        unsigned TU16BPS3               :1;
        unsigned TU16BPS4               :1;
        unsigned TU16BPS5               :1;
        unsigned TU16BPS6               :1;
        unsigned TU16BPS7               :1;
    };
    struct {
        unsigned TU16BPS                :8;
    };
} TU16BPSbits_t;
extern volatile TU16BPSbits_t TU16BPSbits __at(0x3AD);
// bitfield macros
#define _TU16BPS_PS_POSN                                    0x0
#define _TU16BPS_PS_POSITION                                0x0
#define _TU16BPS_PS_SIZE                                    0x8
#define _TU16BPS_PS_LENGTH                                  0x8
#define _TU16BPS_PS_MASK                                    0xFF
#define _TU16BPS_PS0_POSN                                   0x0
#define _TU16BPS_PS0_POSITION                               0x0
#define _TU16BPS_PS0_SIZE                                   0x1
#define _TU16BPS_PS0_LENGTH                                 0x1
#define _TU16BPS_PS0_MASK                                   0x1
#define _TU16BPS_PS1_POSN                                   0x1
#define _TU16BPS_PS1_POSITION                               0x1
#define _TU16BPS_PS1_SIZE                                   0x1
#define _TU16BPS_PS1_LENGTH                                 0x1
#define _TU16BPS_PS1_MASK                                   0x2
#define _TU16BPS_PS2_POSN                                   0x2
#define _TU16BPS_PS2_POSITION                               0x2
#define _TU16BPS_PS2_SIZE                                   0x1
#define _TU16BPS_PS2_LENGTH                                 0x1
#define _TU16BPS_PS2_MASK                                   0x4
#define _TU16BPS_PS3_POSN                                   0x3
#define _TU16BPS_PS3_POSITION                               0x3
#define _TU16BPS_PS3_SIZE                                   0x1
#define _TU16BPS_PS3_LENGTH                                 0x1
#define _TU16BPS_PS3_MASK                                   0x8
#define _TU16BPS_PS4_POSN                                   0x4
#define _TU16BPS_PS4_POSITION                               0x4
#define _TU16BPS_PS4_SIZE                                   0x1
#define _TU16BPS_PS4_LENGTH                                 0x1
#define _TU16BPS_PS4_MASK                                   0x10
#define _TU16BPS_PS5_POSN                                   0x5
#define _TU16BPS_PS5_POSITION                               0x5
#define _TU16BPS_PS5_SIZE                                   0x1
#define _TU16BPS_PS5_LENGTH                                 0x1
#define _TU16BPS_PS5_MASK                                   0x20
#define _TU16BPS_PS6_POSN                                   0x6
#define _TU16BPS_PS6_POSITION                               0x6
#define _TU16BPS_PS6_SIZE                                   0x1
#define _TU16BPS_PS6_LENGTH                                 0x1
#define _TU16BPS_PS6_MASK                                   0x40
#define _TU16BPS_PS7_POSN                                   0x7
#define _TU16BPS_PS7_POSITION                               0x7
#define _TU16BPS_PS7_SIZE                                   0x1
#define _TU16BPS_PS7_LENGTH                                 0x1
#define _TU16BPS_PS7_MASK                                   0x80
#define _TU16BPS_TU16BPS0_POSN                              0x0
#define _TU16BPS_TU16BPS0_POSITION                          0x0
#define _TU16BPS_TU16BPS0_SIZE                              0x1
#define _TU16BPS_TU16BPS0_LENGTH                            0x1
#define _TU16BPS_TU16BPS0_MASK                              0x1
#define _TU16BPS_TU16BPS1_POSN                              0x1
#define _TU16BPS_TU16BPS1_POSITION                          0x1
#define _TU16BPS_TU16BPS1_SIZE                              0x1
#define _TU16BPS_TU16BPS1_LENGTH                            0x1
#define _TU16BPS_TU16BPS1_MASK                              0x2
#define _TU16BPS_TU16BPS2_POSN                              0x2
#define _TU16BPS_TU16BPS2_POSITION                          0x2
#define _TU16BPS_TU16BPS2_SIZE                              0x1
#define _TU16BPS_TU16BPS2_LENGTH                            0x1
#define _TU16BPS_TU16BPS2_MASK                              0x4
#define _TU16BPS_TU16BPS3_POSN                              0x3
#define _TU16BPS_TU16BPS3_POSITION                          0x3
#define _TU16BPS_TU16BPS3_SIZE                              0x1
#define _TU16BPS_TU16BPS3_LENGTH                            0x1
#define _TU16BPS_TU16BPS3_MASK                              0x8
#define _TU16BPS_TU16BPS4_POSN                              0x4
#define _TU16BPS_TU16BPS4_POSITION                          0x4
#define _TU16BPS_TU16BPS4_SIZE                              0x1
#define _TU16BPS_TU16BPS4_LENGTH                            0x1
#define _TU16BPS_TU16BPS4_MASK                              0x10
#define _TU16BPS_TU16BPS5_POSN                              0x5
#define _TU16BPS_TU16BPS5_POSITION                          0x5
#define _TU16BPS_TU16BPS5_SIZE                              0x1
#define _TU16BPS_TU16BPS5_LENGTH                            0x1
#define _TU16BPS_TU16BPS5_MASK                              0x20
#define _TU16BPS_TU16BPS6_POSN                              0x6
#define _TU16BPS_TU16BPS6_POSITION                          0x6
#define _TU16BPS_TU16BPS6_SIZE                              0x1
#define _TU16BPS_TU16BPS6_LENGTH                            0x1
#define _TU16BPS_TU16BPS6_MASK                              0x40
#define _TU16BPS_TU16BPS7_POSN                              0x7
#define _TU16BPS_TU16BPS7_POSITION                          0x7
#define _TU16BPS_TU16BPS7_SIZE                              0x1
#define _TU16BPS_TU16BPS7_LENGTH                            0x1
#define _TU16BPS_TU16BPS7_MASK                              0x80
#define _TU16BPS_TU16BPS_POSN                               0x0
#define _TU16BPS_TU16BPS_POSITION                           0x0
#define _TU16BPS_TU16BPS_SIZE                               0x8
#define _TU16BPS_TU16BPS_LENGTH                             0x8
#define _TU16BPS_TU16BPS_MASK                               0xFF

