garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f54q71.h
// Register: TU16BCLK
#define TU16BCLK TU16BCLK
extern volatile unsigned char           TU16BCLK            __at(0x3B2);
#ifndef _LIB_BUILD
asm("TU16BCLK equ 03B2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
        unsigned CLK4                   :1;
    };
    struct {
        unsigned TU16BCLK0              :1;
        unsigned TU16BCLK1              :1;
        unsigned TU16BCLK2              :1;
        unsigned TU16BCLK3              :1;
        unsigned TU16BCLK4              :1;
    };
} TU16BCLKbits_t;
extern volatile TU16BCLKbits_t TU16BCLKbits __at(0x3B2);
// bitfield macros
#define _TU16BCLK_CLK_POSN                                  0x0
#define _TU16BCLK_CLK_POSITION                              0x0
#define _TU16BCLK_CLK_SIZE                                  0x8
#define _TU16BCLK_CLK_LENGTH                                0x8
#define _TU16BCLK_CLK_MASK                                  0xFF
#define _TU16BCLK_CLK0_POSN                                 0x0
#define _TU16BCLK_CLK0_POSITION                             0x0
#define _TU16BCLK_CLK0_SIZE                                 0x1
#define _TU16BCLK_CLK0_LENGTH                               0x1
#define _TU16BCLK_CLK0_MASK                                 0x1
#define _TU16BCLK_CLK1_POSN                                 0x1
#define _TU16BCLK_CLK1_POSITION                             0x1
#define _TU16BCLK_CLK1_SIZE                                 0x1
#define _TU16BCLK_CLK1_LENGTH                               0x1
#define _TU16BCLK_CLK1_MASK                                 0x2
#define _TU16BCLK_CLK2_POSN                                 0x2
#define _TU16BCLK_CLK2_POSITION                             0x2
#define _TU16BCLK_CLK2_SIZE                                 0x1
#define _TU16BCLK_CLK2_LENGTH                               0x1
#define _TU16BCLK_CLK2_MASK                                 0x4
#define _TU16BCLK_CLK3_POSN                                 0x3
#define _TU16BCLK_CLK3_POSITION                             0x3
#define _TU16BCLK_CLK3_SIZE                                 0x1
#define _TU16BCLK_CLK3_LENGTH                               0x1
#define _TU16BCLK_CLK3_MASK                                 0x8
#define _TU16BCLK_CLK4_POSN                                 0x4
#define _TU16BCLK_CLK4_POSITION                             0x4
#define _TU16BCLK_CLK4_SIZE                                 0x1
#define _TU16BCLK_CLK4_LENGTH                               0x1
#define _TU16BCLK_CLK4_MASK                                 0x10
#define _TU16BCLK_TU16BCLK0_POSN                            0x0
#define _TU16BCLK_TU16BCLK0_POSITION                        0x0
#define _TU16BCLK_TU16BCLK0_SIZE                            0x1
#define _TU16BCLK_TU16BCLK0_LENGTH                          0x1
#define _TU16BCLK_TU16BCLK0_MASK                            0x1
#define _TU16BCLK_TU16BCLK1_POSN                            0x1
#define _TU16BCLK_TU16BCLK1_POSITION                        0x1
#define _TU16BCLK_TU16BCLK1_SIZE                            0x1
#define _TU16BCLK_TU16BCLK1_LENGTH                          0x1
#define _TU16BCLK_TU16BCLK1_MASK                            0x2
#define _TU16BCLK_TU16BCLK2_POSN                            0x2
#define _TU16BCLK_TU16BCLK2_POSITION                        0x2
#define _TU16BCLK_TU16BCLK2_SIZE                            0x1
#define _TU16BCLK_TU16BCLK2_LENGTH                          0x1
#define _TU16BCLK_TU16BCLK2_MASK                            0x4
#define _TU16BCLK_TU16BCLK3_POSN                            0x3
#define _TU16BCLK_TU16BCLK3_POSITION                        0x3
#define _TU16BCLK_TU16BCLK3_SIZE                            0x1
#define _TU16BCLK_TU16BCLK3_LENGTH                          0x1
#define _TU16BCLK_TU16BCLK3_MASK                            0x8
#define _TU16BCLK_TU16BCLK4_POSN                            0x4
#define _TU16BCLK_TU16BCLK4_POSITION                        0x4
#define _TU16BCLK_TU16BCLK4_SIZE                            0x1
#define _TU16BCLK_TU16BCLK4_LENGTH                          0x1
#define _TU16BCLK_TU16BCLK4_MASK                            0x10

// Register: TU16BERS
#define TU16BERS TU16BERS
extern volatile unsigned char           TU16BERS            __at(0x3B3);
#ifndef _LIB_BUILD
asm("TU16BERS equ 03B3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ERS                    :8;
    };
    struct {
        unsigned ERS0                   :1;
        unsigned ERS1                   :1;
        unsigned ERS2                   :1;
        unsigned ERS3                   :1;
        unsigned ERS4                   :1;
    };
    struct {
        unsigned TU16BERS0              :1;
        unsigned TU16BERS1              :1;
        unsigned TU16BERS2              :1;
        unsigned TU16BERS3              :1;
        unsigned TU16BERS4              :1;
    };
} TU16BERSbits_t;
extern volatile TU16BERSbits_t TU16BERSbits __at(0x3B3);
// bitfield macros
#define _TU16BERS_ERS_POSN                                  0x0
#define _TU16BERS_ERS_POSITION                              0x0
#define _TU16BERS_ERS_SIZE                                  0x8
#define _TU16BERS_ERS_LENGTH                                0x8
#define _TU16BERS_ERS_MASK                                  0xFF
#define _TU16BERS_ERS0_POSN                                 0x0
#define _TU16BERS_ERS0_POSITION                             0x0
#define _TU16BERS_ERS0_SIZE                                 0x1
#define _TU16BERS_ERS0_LENGTH                               0x1
#define _TU16BERS_ERS0_MASK                                 0x1
#define _TU16BERS_ERS1_POSN                                 0x1
#define _TU16BERS_ERS1_POSITION                             0x1
#define _TU16BERS_ERS1_SIZE                                 0x1
#define _TU16BERS_ERS1_LENGTH                               0x1
#define _TU16BERS_ERS1_MASK                                 0x2
#define _TU16BERS_ERS2_POSN                                 0x2
#define _TU16BERS_ERS2_POSITION                             0x2
#define _TU16BERS_ERS2_SIZE                                 0x1
#define _TU16BERS_ERS2_LENGTH                               0x1
#define _TU16BERS_ERS2_MASK                                 0x4
#define _TU16BERS_ERS3_POSN                                 0x3
#define _TU16BERS_ERS3_POSITION                             0x3
#define _TU16BERS_ERS3_SIZE                                 0x1
#define _TU16BERS_ERS3_LENGTH                               0x1
#define _TU16BERS_ERS3_MASK                                 0x8
#define _TU16BERS_ERS4_POSN                                 0x4
#define _TU16BERS_ERS4_POSITION                             0x4
#define _TU16BERS_ERS4_SIZE                                 0x1
#define _TU16BERS_ERS4_LENGTH                               0x1
#define _TU16BERS_ERS4_MASK                                 0x10
#define _TU16BERS_TU16BERS0_POSN                            0x0
#define _TU16BERS_TU16BERS0_POSITION                        0x0
#define _TU16BERS_TU16BERS0_SIZE                            0x1
#define _TU16BERS_TU16BERS0_LENGTH                          0x1
#define _TU16BERS_TU16BERS0_MASK                            0x1
#define _TU16BERS_TU16BERS1_POSN                            0x1
#define _TU16BERS_TU16BERS1_POSITION                        0x1
#define _TU16BERS_TU16BERS1_SIZE                            0x1
#define _TU16BERS_TU16BERS1_LENGTH                          0x1
#define _TU16BERS_TU16BERS1_MASK                            0x2
#define _TU16BERS_TU16BERS2_POSN                            0x2
#define _TU16BERS_TU16BERS2_POSITION                        0x2
#define _TU16BERS_TU16BERS2_SIZE                            0x1
#define _TU16BERS_TU16BERS2_LENGTH                          0x1
#define _TU16BERS_TU16BERS2_MASK                            0x4
#define _TU16BERS_TU16BERS3_POSN                            0x3
#define _TU16BERS_TU16BERS3_POSITION                        0x3
#define _TU16BERS_TU16BERS3_SIZE                            0x1
#define _TU16BERS_TU16BERS3_LENGTH                          0x1
#define _TU16BERS_TU16BERS3_MASK                            0x8
#define _TU16BERS_TU16BERS4_POSN                            0x4
#define _TU16BERS_TU16BERS4_POSITION                        0x4
#define _TU16BERS_TU16BERS4_SIZE                            0x1
#define _TU16BERS_TU16BERS4_LENGTH                          0x1
#define _TU16BERS_TU16BERS4_MASK                            0x10

// Register: TUCHAIN
#define TUCHAIN TUCHAIN
extern volatile unsigned char           TUCHAIN             __at(0x3B4);
#ifndef _LIB_BUILD
asm("TUCHAIN equ 03B4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CH16AB                 :1;
    };
} TUCHAINbits_t;
extern volatile TUCHAINbits_t TUCHAINbits __at(0x3B4);
// bitfield macros
#define _TUCHAIN_CH16AB_POSN                                0x0
#define _TUCHAIN_CH16AB_POSITION                            0x0
#define _TUCHAIN_CH16AB_SIZE                                0x1
#define _TUCHAIN_CH16AB_LENGTH                              0x1
#define _TUCHAIN_CH16AB_MASK                                0x1

