garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f54q71.h
extern volatile PIE0bits_t PIE0bits __at(0x4A7);
// bitfield macros
#define _PIE0_SWIE_POSN                                     0x0
#define _PIE0_SWIE_POSITION                                 0x0
#define _PIE0_SWIE_SIZE                                     0x1
#define _PIE0_SWIE_LENGTH                                   0x1
#define _PIE0_SWIE_MASK                                     0x1
#define _PIE0_HLVDIE_POSN                                   0x1
#define _PIE0_HLVDIE_POSITION                               0x1
#define _PIE0_HLVDIE_SIZE                                   0x1
#define _PIE0_HLVDIE_LENGTH                                 0x1
#define _PIE0_HLVDIE_MASK                                   0x2
#define _PIE0_OSFIE_POSN                                    0x2
#define _PIE0_OSFIE_POSITION                                0x2
#define _PIE0_OSFIE_SIZE                                    0x1
#define _PIE0_OSFIE_LENGTH                                  0x1
#define _PIE0_OSFIE_MASK                                    0x4
#define _PIE0_CSWIE_POSN                                    0x3
#define _PIE0_CSWIE_POSITION                                0x3
#define _PIE0_CSWIE_SIZE                                    0x1
#define _PIE0_CSWIE_LENGTH                                  0x1
#define _PIE0_CSWIE_MASK                                    0x8
#define _PIE0_NVMIE_POSN                                    0x4
#define _PIE0_NVMIE_POSITION                                0x4
#define _PIE0_NVMIE_SIZE                                    0x1
#define _PIE0_NVMIE_LENGTH                                  0x1
#define _PIE0_NVMIE_MASK                                    0x10
#define _PIE0_CLC1IE_POSN                                   0x5
#define _PIE0_CLC1IE_POSITION                               0x5
#define _PIE0_CLC1IE_SIZE                                   0x1
#define _PIE0_CLC1IE_LENGTH                                 0x1
#define _PIE0_CLC1IE_MASK                                   0x20
#define _PIE0_CRCIE_POSN                                    0x6
#define _PIE0_CRCIE_POSITION                                0x6
#define _PIE0_CRCIE_SIZE                                    0x1
#define _PIE0_CRCIE_LENGTH                                  0x1
#define _PIE0_CRCIE_MASK                                    0x40
#define _PIE0_IOCIE_POSN                                    0x7
#define _PIE0_IOCIE_POSITION                                0x7
#define _PIE0_IOCIE_SIZE                                    0x1
#define _PIE0_IOCIE_LENGTH                                  0x1
#define _PIE0_IOCIE_MASK                                    0x80

// Register: PIE1
#define PIE1 PIE1
extern volatile unsigned char           PIE1                __at(0x4A8);
#ifndef _LIB_BUILD
asm("PIE1 equ 04A8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IE                 :1;
        unsigned ADCH1IE                :1;
        unsigned ADIE                   :1;
        unsigned ACTIE                  :1;
        unsigned C1IE                   :1;
        unsigned ADCH2IE                :1;
        unsigned ADCH3IE                :1;
        unsigned ADCH4IE                :1;
    };
} PIE1bits_t;
extern volatile PIE1bits_t PIE1bits __at(0x4A8);
// bitfield macros
#define _PIE1_INT0IE_POSN                                   0x0
#define _PIE1_INT0IE_POSITION                               0x0
#define _PIE1_INT0IE_SIZE                                   0x1
#define _PIE1_INT0IE_LENGTH                                 0x1
#define _PIE1_INT0IE_MASK                                   0x1
#define _PIE1_ADCH1IE_POSN                                  0x1
#define _PIE1_ADCH1IE_POSITION                              0x1
#define _PIE1_ADCH1IE_SIZE                                  0x1
#define _PIE1_ADCH1IE_LENGTH                                0x1
#define _PIE1_ADCH1IE_MASK                                  0x2
#define _PIE1_ADIE_POSN                                     0x2
#define _PIE1_ADIE_POSITION                                 0x2
#define _PIE1_ADIE_SIZE                                     0x1
#define _PIE1_ADIE_LENGTH                                   0x1
#define _PIE1_ADIE_MASK                                     0x4
#define _PIE1_ACTIE_POSN                                    0x3
#define _PIE1_ACTIE_POSITION                                0x3
#define _PIE1_ACTIE_SIZE                                    0x1
#define _PIE1_ACTIE_LENGTH                                  0x1
#define _PIE1_ACTIE_MASK                                    0x8
#define _PIE1_C1IE_POSN                                     0x4
#define _PIE1_C1IE_POSITION                                 0x4
#define _PIE1_C1IE_SIZE                                     0x1
#define _PIE1_C1IE_LENGTH                                   0x1
#define _PIE1_C1IE_MASK                                     0x10
#define _PIE1_ADCH2IE_POSN                                  0x5
#define _PIE1_ADCH2IE_POSITION                              0x5
#define _PIE1_ADCH2IE_SIZE                                  0x1
#define _PIE1_ADCH2IE_LENGTH                                0x1
#define _PIE1_ADCH2IE_MASK                                  0x20
#define _PIE1_ADCH3IE_POSN                                  0x6
#define _PIE1_ADCH3IE_POSITION                              0x6
#define _PIE1_ADCH3IE_SIZE                                  0x1
#define _PIE1_ADCH3IE_LENGTH                                0x1
#define _PIE1_ADCH3IE_MASK                                  0x40
#define _PIE1_ADCH4IE_POSN                                  0x7
#define _PIE1_ADCH4IE_POSITION                              0x7
#define _PIE1_ADCH4IE_SIZE                                  0x1
#define _PIE1_ADCH4IE_LENGTH                                0x1
#define _PIE1_ADCH4IE_MASK                                  0x80

// Register: PIE2
#define PIE2 PIE2
extern volatile unsigned char           PIE2                __at(0x4A9);
#ifndef _LIB_BUILD
asm("PIE2 equ 04A9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ZCDIE                  :1;
        unsigned CLC5IE                 :1;
        unsigned IOCSRIE                :1;
        unsigned                        :1;
        unsigned DMA1SCNTIE             :1;
        unsigned DMA1DCNTIE             :1;
        unsigned DMA1ORIE               :1;
        unsigned DMA1AIE                :1;
    };
} PIE2bits_t;
extern volatile PIE2bits_t PIE2bits __at(0x4A9);
// bitfield macros
#define _PIE2_ZCDIE_POSN                                    0x0
#define _PIE2_ZCDIE_POSITION                                0x0
#define _PIE2_ZCDIE_SIZE                                    0x1
#define _PIE2_ZCDIE_LENGTH                                  0x1
#define _PIE2_ZCDIE_MASK                                    0x1
#define _PIE2_CLC5IE_POSN                                   0x1
#define _PIE2_CLC5IE_POSITION                               0x1
#define _PIE2_CLC5IE_SIZE                                   0x1
#define _PIE2_CLC5IE_LENGTH                                 0x1
#define _PIE2_CLC5IE_MASK                                   0x2
#define _PIE2_IOCSRIE_POSN                                  0x2
#define _PIE2_IOCSRIE_POSITION                              0x2
#define _PIE2_IOCSRIE_SIZE                                  0x1
#define _PIE2_IOCSRIE_LENGTH                                0x1
#define _PIE2_IOCSRIE_MASK                                  0x4
#define _PIE2_DMA1SCNTIE_POSN                               0x4
#define _PIE2_DMA1SCNTIE_POSITION                           0x4
#define _PIE2_DMA1SCNTIE_SIZE                               0x1
#define _PIE2_DMA1SCNTIE_LENGTH                             0x1
#define _PIE2_DMA1SCNTIE_MASK                               0x10
#define _PIE2_DMA1DCNTIE_POSN                               0x5
#define _PIE2_DMA1DCNTIE_POSITION                           0x5
#define _PIE2_DMA1DCNTIE_SIZE                               0x1
#define _PIE2_DMA1DCNTIE_LENGTH                             0x1
#define _PIE2_DMA1DCNTIE_MASK                               0x20
#define _PIE2_DMA1ORIE_POSN                                 0x6
#define _PIE2_DMA1ORIE_POSITION                             0x6
#define _PIE2_DMA1ORIE_SIZE                                 0x1
#define _PIE2_DMA1ORIE_LENGTH                               0x1
#define _PIE2_DMA1ORIE_MASK                                 0x40
#define _PIE2_DMA1AIE_POSN                                  0x7
#define _PIE2_DMA1AIE_POSITION                              0x7
#define _PIE2_DMA1AIE_SIZE                                  0x1
#define _PIE2_DMA1AIE_LENGTH                                0x1
#define _PIE2_DMA1AIE_MASK                                  0x80

// Register: PIE3
#define PIE3 PIE3
extern volatile unsigned char           PIE3                __at(0x4AA);
#ifndef _LIB_BUILD
asm("PIE3 equ 04AAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1RXIE               :1;
        unsigned SPI1TXIE               :1;
        unsigned SPI1IE                 :1;
        unsigned TMR2IE                 :1;
        unsigned TMR1IE                 :1;
        unsigned TMR1GIE                :1;
        unsigned CCP1IE                 :1;
        unsigned TMR0IE                 :1;
    };
} PIE3bits_t;
