garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f54q71.h
// Register: TOSL
#define TOSL TOSL
extern volatile unsigned char           TOSL                __at(0x4FD);
#ifndef _LIB_BUILD
asm("TOSL equ 04FDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSL                   :8;
    };
} TOSLbits_t;
extern volatile TOSLbits_t TOSLbits __at(0x4FD);
// bitfield macros
#define _TOSL_TOSL_POSN                                     0x0
#define _TOSL_TOSL_POSITION                                 0x0
#define _TOSL_TOSL_SIZE                                     0x8
#define _TOSL_TOSL_LENGTH                                   0x8
#define _TOSL_TOSL_MASK                                     0xFF

// Register: TOSH
#define TOSH TOSH
extern volatile unsigned char           TOSH                __at(0x4FE);
#ifndef _LIB_BUILD
asm("TOSH equ 04FEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSH                   :8;
    };
} TOSHbits_t;
extern volatile TOSHbits_t TOSHbits __at(0x4FE);
// bitfield macros
#define _TOSH_TOSH_POSN                                     0x0
#define _TOSH_TOSH_POSITION                                 0x0
#define _TOSH_TOSH_SIZE                                     0x8
#define _TOSH_TOSH_LENGTH                                   0x8
#define _TOSH_TOSH_MASK                                     0xFF

// Register: TOSU
#define TOSU TOSU
extern volatile unsigned char           TOSU                __at(0x4FF);
#ifndef _LIB_BUILD
asm("TOSU equ 04FFh");
#endif

/*
 * Register Mirrors in DMA Space
 */

// Register: CCPR1L
#define                                 CCPR1L_M1           0x4000
// Register: CCPR1H
#define                                 CCPR1H_M1           0x4001
// Register: CCPR2L
#define                                 CCPR2L_M1           0x4002
// Register: CCPR2H
#define                                 CCPR2H_M1           0x4003
// Register: PWM1S1P1L
#define                                 PWM1S1P1L_M1        0x4006
// Register: PWM1S1P1H
#define                                 PWM1S1P1H_M1        0x4007
// Register: PWM2S1P1L
#define                                 PWM2S1P1L_M1        0x4008
// Register: PWM2S1P1H
#define                                 PWM2S1P1H_M1        0x4009
// Register: PWM3S1P1L
#define                                 PWM3S1P1L_M1        0x400A
// Register: PWM3S1P1H
#define                                 PWM3S1P1H_M1        0x400B
// Register: PWM1S1P1L
#define                                 PWM1S1P1L_M2        0x4010
// Register: PWM1S1P1H
#define                                 PWM1S1P1H_M2        0x4011
// Register: PWM1S1P2L
#define                                 PWM1S1P2L_M1        0x4012
// Register: PWM1S1P2H
#define                                 PWM1S1P2H_M1        0x4013
// Register: PWM2S1P1L
#define                                 PWM2S1P1L_M2        0x4014
// Register: PWM2S1P1H
#define                                 PWM2S1P1H_M2        0x4015
// Register: PWM2S1P2L
#define                                 PWM2S1P2L_M1        0x4016
// Register: PWM2S1P2H
#define                                 PWM2S1P2H_M1        0x4017
// Register: PWM3S1P1L
#define                                 PWM3S1P1L_M2        0x4018
// Register: PWM3S1P1H
#define                                 PWM3S1P1H_M2        0x4019
// Register: PWM3S1P2L
#define                                 PWM3S1P2L_M1        0x401A
// Register: PWM3S1P2H
#define                                 PWM3S1P2H_M1        0x401B
// Register: PWM1S1P1L
#define                                 PWM1S1P1L_M3        0x4020
// Register: PWM1S1P1H
#define                                 PWM1S1P1H_M3        0x4021
// Register: PWM1S1P2L
#define                                 PWM1S1P2L_M2        0x4022
// Register: PWM1S1P2H
#define                                 PWM1S1P2H_M2        0x4023
// Register: PWM1PRL
#define                                 PWM1PRL_M1          0x4024
// Register: PWM1PRH
#define                                 PWM1PRH_M1          0x4025
// Register: PWM2S1P1L
#define                                 PWM2S1P1L_M3        0x4026
// Register: PWM2S1P1H
#define                                 PWM2S1P1H_M3        0x4027
// Register: PWM2S1P2L
#define                                 PWM2S1P2L_M2        0x4028
// Register: PWM2S1P2H
#define                                 PWM2S1P2H_M2        0x4029
// Register: PWM2PRL
#define                                 PWM2PRL_M1          0x402A
// Register: PWM2PRH
#define                                 PWM2PRH_M1          0x402B
// Register: PWM3S1P1L
#define                                 PWM3S1P1L_M3        0x402C
// Register: PWM3S1P1H
#define                                 PWM3S1P1H_M3        0x402D
// Register: PWM3S1P2L
#define                                 PWM3S1P2L_M2        0x402E
// Register: PWM3S1P2H
#define                                 PWM3S1P2H_M2        0x402F
// Register: PWM3PRL
#define                                 PWM3PRL_M1          0x4030
// Register: PWM3PRH
#define                                 PWM3PRH_M1          0x4031
// Register: CCPR1L
#define                                 CCPR1L_M2           0x4040
// Register: CCPR1H
#define                                 CCPR1H_M2           0x4041
// Register: T2PR
#define                                 T2PR_M1             0x4042
// Register: CCPR2L
#define                                 CCPR2L_M2           0x4043
// Register: CCPR2H
#define                                 CCPR2H_M2           0x4044
// Register: T4PR
#define                                 T4PR_M1             0x4045
// Register: ADLTHL
#define                                 ADLTHL_CX1          0x4060
// Register: ADLTHH
#define                                 ADLTHH_CX1          0x4061
// Register: ADUTHL
#define                                 ADUTHL_CX1          0x4062
// Register: ADUTHH
#define                                 ADUTHH_CX1          0x4063
// Register: ADERRL
#define                                 ADERRL_CX1          0x4064
// Register: ADERRH
#define                                 ADERRH_CX1          0x4065
// Register: ADSTPTL
#define                                 ADSTPTL_CX1         0x4066
// Register: ADSTPTH
#define                                 ADSTPTH_CX1         0x4067
// Register: ADFLTRL
#define                                 ADFLTRL_CX1         0x4068
// Register: ADFLTRH
#define                                 ADFLTRH_CX1         0x4069
// Register: ADACCL
#define                                 ADACCL_CX1          0x406A
// Register: ADACCH
#define                                 ADACCH_CX1          0x406B
// Register: ADACCU
#define                                 ADACCU_CX1          0x406C
// Register: ADCNT
#define                                 ADCNT_CX1           0x406D
// Register: ADRPT
#define                                 ADRPT_CX1           0x406E
// Register: ADPREVL
#define                                 ADPREVL_CX1         0x406F
// Register: ADPREVH
#define                                 ADPREVH_CX1         0x4070
// Register: ADACQL
#define                                 ADACQL_CX1          0x4071
// Register: ADACQH
#define                                 ADACQH_CX1          0x4072
// Register: ADCAP
#define                                 ADCAP_CX1           0x4073
// Register: ADCON0
#define                                 ADCON0_CX1          0x4074
// Register: ADCON1
#define                                 ADCON1_CX1          0x4075
// Register: ADCON2
#define                                 ADCON2_CX1          0x4076
// Register: ADCON3
#define                                 ADCON3_CX1          0x4077
// Register: ADREF
#define                                 ADREF_CX1           0x4078
// Register: ADACT
#define                                 ADACT_CX1           0x4079
// Register: ADCLK
#define                                 ADCLK_CX1           0x407A
// Register: ADPCH
#define                                 ADPCH_CX1           0x407B
// Register: ADNCH
#define                                 ADNCH_CX1           0x407C
// Register: ADRESL
#define                                 ADRESL_CX1          0x407D
// Register: ADRESH
#define                                 ADRESH_CX1          0x407E
// Register: ADPREL
#define                                 ADPREL_CX1          0x407F
// Register: ADPREH
#define                                 ADPREH_CX1          0x4080
// Register: ADLTHL
#define                                 ADLTHL_CX2          0x4081
// Register: ADLTHH
#define                                 ADLTHH_CX2          0x4082
// Register: ADUTHL
#define                                 ADUTHL_CX2          0x4083
// Register: ADUTHH
#define                                 ADUTHH_CX2          0x4084
// Register: ADERRL
#define                                 ADERRL_CX2          0x4085
// Register: ADERRH
#define                                 ADERRH_CX2          0x4086
// Register: ADSTPTL
#define                                 ADSTPTL_CX2         0x4087
// Register: ADSTPTH
#define                                 ADSTPTH_CX2         0x4088
// Register: ADFLTRL
#define                                 ADFLTRL_CX2         0x4089
// Register: ADFLTRH
#define                                 ADFLTRH_CX2         0x408A
// Register: ADACCL
#define                                 ADACCL_CX2          0x408B
// Register: ADACCH
#define                                 ADACCH_CX2          0x408C
// Register: ADACCU
#define                                 ADACCU_CX2          0x408D
// Register: ADCNT
#define                                 ADCNT_CX2           0x408E
// Register: ADRPT
#define                                 ADRPT_CX2           0x408F
// Register: ADPREVL
#define                                 ADPREVL_CX2         0x4090
// Register: ADPREVH
#define                                 ADPREVH_CX2         0x4091
// Register: ADACQL
#define                                 ADACQL_CX2          0x4092
// Register: ADACQH
#define                                 ADACQH_CX2          0x4093
// Register: ADCAP
#define                                 ADCAP_CX2           0x4094
// Register: ADCON0
#define                                 ADCON0_CX2          0x4095
// Register: ADCON1
#define                                 ADCON1_CX2          0x4096
// Register: ADCON2
#define                                 ADCON2_CX2          0x4097
// Register: ADCON3
#define                                 ADCON3_CX2          0x4098
// Register: ADREF
#define                                 ADREF_CX2           0x4099
// Register: ADACT
#define                                 ADACT_CX2           0x409A
// Register: ADCLK
#define                                 ADCLK_CX2           0x409B
// Register: ADPCH
#define                                 ADPCH_CX2           0x409C
// Register: ADNCH
#define                                 ADNCH_CX2           0x409D
// Register: ADRESL
#define                                 ADRESL_CX2          0x409E
// Register: ADRESH
#define                                 ADRESH_CX2          0x409F
// Register: ADPREL
#define                                 ADPREL_CX2          0x40A0
// Register: ADPREH
#define                                 ADPREH_CX2          0x40A1
// Register: ADLTHL
#define                                 ADLTHL_CX3          0x40A2
// Register: ADLTHH
#define                                 ADLTHH_CX3          0x40A3
// Register: ADUTHL
#define                                 ADUTHL_CX3          0x40A4
// Register: ADUTHH
#define                                 ADUTHH_CX3          0x40A5
// Register: ADERRL
#define                                 ADERRL_CX3          0x40A6
// Register: ADERRH
#define                                 ADERRH_CX3          0x40A7
// Register: ADSTPTL
#define                                 ADSTPTL_CX3         0x40A8
// Register: ADSTPTH
#define                                 ADSTPTH_CX3         0x40A9
// Register: ADFLTRL
#define                                 ADFLTRL_CX3         0x40AA
// Register: ADFLTRH
#define                                 ADFLTRH_CX3         0x40AB
// Register: ADACCL
#define                                 ADACCL_CX3          0x40AC
// Register: ADACCH
#define                                 ADACCH_CX3          0x40AD
// Register: ADACCU
#define                                 ADACCU_CX3          0x40AE
// Register: ADCNT
#define                                 ADCNT_CX3           0x40AF
// Register: ADRPT
#define                                 ADRPT_CX3           0x40B0
// Register: ADPREVL
#define                                 ADPREVL_CX3         0x40B1
// Register: ADPREVH
#define                                 ADPREVH_CX3         0x40B2
// Register: ADACQL
#define                                 ADACQL_CX3          0x40B3
// Register: ADACQH
#define                                 ADACQH_CX3          0x40B4
// Register: ADCAP
#define                                 ADCAP_CX3           0x40B5
// Register: ADCON0
#define                                 ADCON0_CX3          0x40B6
// Register: ADCON1
#define                                 ADCON1_CX3          0x40B7
// Register: ADCON2
#define                                 ADCON2_CX3          0x40B8
// Register: ADCON3
#define                                 ADCON3_CX3          0x40B9
// Register: ADREF
#define                                 ADREF_CX3           0x40BA
// Register: ADACT
#define                                 ADACT_CX3           0x40BB
// Register: ADCLK
#define                                 ADCLK_CX3           0x40BC
// Register: ADPCH
#define                                 ADPCH_CX3           0x40BD
// Register: ADNCH
#define                                 ADNCH_CX3           0x40BE
// Register: ADRESL
#define                                 ADRESL_CX3          0x40BF
// Register: ADRESH
#define                                 ADRESH_CX3          0x40C0
// Register: ADPREL
#define                                 ADPREL_CX3          0x40C1
// Register: ADPREH
#define                                 ADPREH_CX3          0x40C2
// Register: ADLTHL
#define                                 ADLTHL_CX4          0x40C3
// Register: ADLTHH
#define                                 ADLTHH_CX4          0x40C4
// Register: ADUTHL
#define                                 ADUTHL_CX4          0x40C5
// Register: ADUTHH
#define                                 ADUTHH_CX4          0x40C6
// Register: ADERRL
#define                                 ADERRL_CX4          0x40C7
// Register: ADERRH
#define                                 ADERRH_CX4          0x40C8
// Register: ADSTPTL
#define                                 ADSTPTL_CX4         0x40C9
// Register: ADSTPTH
#define                                 ADSTPTH_CX4         0x40CA
// Register: ADFLTRL
#define                                 ADFLTRL_CX4         0x40CB
// Register: ADFLTRH
#define                                 ADFLTRH_CX4         0x40CC
// Register: ADACCL
#define                                 ADACCL_CX4          0x40CD
// Register: ADACCH
#define                                 ADACCH_CX4          0x40CE
// Register: ADACCU
#define                                 ADACCU_CX4          0x40CF
// Register: ADCNT
#define                                 ADCNT_CX4           0x40D0
// Register: ADRPT
#define                                 ADRPT_CX4           0x40D1
// Register: ADPREVL
#define                                 ADPREVL_CX4         0x40D2
// Register: ADPREVH
#define                                 ADPREVH_CX4         0x40D3
// Register: ADACQL
#define                                 ADACQL_CX4          0x40D4
// Register: ADACQH
#define                                 ADACQH_CX4          0x40D5
// Register: ADCAP
#define                                 ADCAP_CX4           0x40D6
// Register: ADCON0
#define                                 ADCON0_CX4          0x40D7
// Register: ADCON1
#define                                 ADCON1_CX4          0x40D8
// Register: ADCON2
#define                                 ADCON2_CX4          0x40D9
// Register: ADCON3
#define                                 ADCON3_CX4          0x40DA
// Register: ADREF
#define                                 ADREF_CX4           0x40DB
// Register: ADACT
#define                                 ADACT_CX4           0x40DC
// Register: ADCLK
#define                                 ADCLK_CX4           0x40DD
// Register: ADPCH
#define                                 ADPCH_CX4           0x40DE
// Register: ADNCH
#define                                 ADNCH_CX4           0x40DF
// Register: ADRESL
#define                                 ADRESL_CX4          0x40E0
// Register: ADRESH
#define                                 ADRESH_CX4          0x40E1
// Register: ADPREL
#define                                 ADPREL_CX4          0x40E2
// Register: ADPREH
#define                                 ADPREH_CX4          0x40E3
// Register: ADLTHL
#define                                 ADLTHL_M1           0x40E4
// Register: ADLTHH
#define                                 ADLTHH_M1           0x40E5
// Register: ADUTHL
#define                                 ADUTHL_M1           0x40E6
// Register: ADUTHH
#define                                 ADUTHH_M1           0x40E7
// Register: ADERRL
#define                                 ADERRL_M1           0x40E8
// Register: ADERRH
#define                                 ADERRH_M1           0x40E9
// Register: ADSTPTL
#define                                 ADSTPTL_M1          0x40EA
// Register: ADSTPTH
#define                                 ADSTPTH_M1          0x40EB
// Register: ADFLTRL
#define                                 ADFLTRL_M1          0x40EC
// Register: ADFLTRH
#define                                 ADFLTRH_M1          0x40ED
// Register: ADACCL
#define                                 ADACCL_M1           0x40EE
// Register: ADACCH
#define                                 ADACCH_M1           0x40EF
// Register: ADACCU
#define                                 ADACCU_M1           0x40F0
// Register: ADCNT
#define                                 ADCNT_M1            0x40F1
// Register: ADRPT
#define                                 ADRPT_M1            0x40F2
// Register: ADPREVL
#define                                 ADPREVL_M1          0x40F3
// Register: ADPREVH
#define                                 ADPREVH_M1          0x40F4
// Register: ADACQL
#define                                 ADACQL_M1           0x40F5
// Register: ADACQH
#define                                 ADACQH_M1           0x40F6
// Register: ADCAP
#define                                 ADCAP_M1            0x40F7
// Register: ADPCH
#define                                 ADPCH_M1            0x40F8
// Register: ADNCH
#define                                 ADNCH_M1            0x40F9
// Register: ADRESL
#define                                 ADRESL_M1           0x40FA
// Register: ADRESH
#define                                 ADRESH_M1           0x40FB
// Register: DMAnBUF
#define                                 DMAnBUF_DMA1        0x4100
// Register: DMAnDCNTL
#define                                 DMAnDCNTL_DMA1      0x4101
// Register: DMAnDCNTH
#define                                 DMAnDCNTH_DMA1      0x4102
// Register: DMAnDPTRL
#define                                 DMAnDPTRL_DMA1      0x4103
// Register: DMAnDPTRH
#define                                 DMAnDPTRH_DMA1      0x4104
// Register: DMAnDSZL
#define                                 DMAnDSZL_DMA1       0x4105
// Register: DMAnDSZH
#define                                 DMAnDSZH_DMA1       0x4106
// Register: DMAnDSAL
#define                                 DMAnDSAL_DMA1       0x4107
// Register: DMAnDSAH
#define                                 DMAnDSAH_DMA1       0x4108
// Register: DMAnSCNTL
#define                                 DMAnSCNTL_DMA1      0x4109
// Register: DMAnSCNTH
#define                                 DMAnSCNTH_DMA1      0x410A
// Register: DMAnSPTRL
#define                                 DMAnSPTRL_DMA1      0x410B
// Register: DMAnSPTRH
#define                                 DMAnSPTRH_DMA1      0x410C
// Register: DMAnSPTRU
#define                                 DMAnSPTRU_DMA1      0x410D
// Register: DMAnSSZL
#define                                 DMAnSSZL_DMA1       0x410E
// Register: DMAnSSZH
#define                                 DMAnSSZH_DMA1       0x410F
// Register: DMAnSSAL
#define                                 DMAnSSAL_DMA1       0x4110
// Register: DMAnSSAH
#define                                 DMAnSSAH_DMA1       0x4111
// Register: DMAnSSAU
#define                                 DMAnSSAU_DMA1       0x4112
// Register: DMAnCON0
#define                                 DMAnCON0_DMA1       0x4113
// Register: DMAnCON1
#define                                 DMAnCON1_DMA1       0x4114
// Register: DMAnAIRQ
#define                                 DMAnAIRQ_DMA1       0x4115
// Register: DMAnSIRQ
#define                                 DMAnSIRQ_DMA1       0x4116
// Register: DMAnBUF
#define                                 DMAnBUF_DMA2        0x4117
// Register: DMAnDCNTL
#define                                 DMAnDCNTL_DMA2      0x4118
// Register: DMAnDCNTH
#define                                 DMAnDCNTH_DMA2      0x4119
// Register: DMAnDPTRL
#define                                 DMAnDPTRL_DMA2      0x411A
// Register: DMAnDPTRH
#define                                 DMAnDPTRH_DMA2      0x411B
// Register: DMAnDSZL
#define                                 DMAnDSZL_DMA2       0x411C
// Register: DMAnDSZH
#define                                 DMAnDSZH_DMA2       0x411D
// Register: DMAnDSAL
#define                                 DMAnDSAL_DMA2       0x411E
// Register: DMAnDSAH
#define                                 DMAnDSAH_DMA2       0x411F
// Register: DMAnSCNTL
#define                                 DMAnSCNTL_DMA2      0x4120
// Register: DMAnSCNTH
#define                                 DMAnSCNTH_DMA2      0x4121
// Register: DMAnSPTRL
#define                                 DMAnSPTRL_DMA2      0x4122
// Register: DMAnSPTRH
#define                                 DMAnSPTRH_DMA2      0x4123
// Register: DMAnSPTRU
#define                                 DMAnSPTRU_DMA2      0x4124
// Register: DMAnSSZL
#define                                 DMAnSSZL_DMA2       0x4125
// Register: DMAnSSZH
#define                                 DMAnSSZH_DMA2       0x4126
// Register: DMAnSSAL
#define                                 DMAnSSAL_DMA2       0x4127
// Register: DMAnSSAH
#define                                 DMAnSSAH_DMA2       0x4128
// Register: DMAnSSAU
#define                                 DMAnSSAU_DMA2       0x4129
// Register: DMAnCON0
#define                                 DMAnCON0_DMA2       0x412A
// Register: DMAnCON1
#define                                 DMAnCON1_DMA2       0x412B
// Register: DMAnAIRQ
#define                                 DMAnAIRQ_DMA2       0x412C
// Register: DMAnSIRQ
#define                                 DMAnSIRQ_DMA2       0x412D
// Register: DMAnBUF
#define                                 DMAnBUF_DMA3        0x412E
// Register: DMAnDCNTL
#define                                 DMAnDCNTL_DMA3      0x412F
// Register: DMAnDCNTH
#define                                 DMAnDCNTH_DMA3      0x4130
// Register: DMAnDPTRL
#define                                 DMAnDPTRL_DMA3      0x4131
// Register: DMAnDPTRH
#define                                 DMAnDPTRH_DMA3      0x4132
// Register: DMAnDSZL
#define                                 DMAnDSZL_DMA3       0x4133
// Register: DMAnDSZH
#define                                 DMAnDSZH_DMA3       0x4134
// Register: DMAnDSAL
