garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f54q71.h
#define                                 ADSOI_bit           _BIT_ACCESS(ADCON3,3)
// ADSTAT<ADSTAT0>
extern volatile __bit                   ADSTAT0             __at(0x1FB8);	// @ (0x3F7 * 8 + 0)
#define                                 ADSTAT0_bit         _BIT_ACCESS(ADSTAT,0)
// ADSTAT<ADSTAT1>
extern volatile __bit                   ADSTAT1             __at(0x1FB9);	// @ (0x3F7 * 8 + 1)
#define                                 ADSTAT1_bit         _BIT_ACCESS(ADSTAT,1)
// ADSTAT<ADSTAT2>
extern volatile __bit                   ADSTAT2             __at(0x1FBA);	// @ (0x3F7 * 8 + 2)
#define                                 ADSTAT2_bit         _BIT_ACCESS(ADSTAT,2)
// ADSTPTL<ADSTPT0>
extern volatile __bit                   ADSTPT0             __at(0x1EF8);	// @ (0x3DF * 8 + 0)
#define                                 ADSTPT0_bit         _BIT_ACCESS(ADSTPTL,0)
// ADSTPTL<ADSTPT1>
extern volatile __bit                   ADSTPT1             __at(0x1EF9);	// @ (0x3DF * 8 + 1)
#define                                 ADSTPT1_bit         _BIT_ACCESS(ADSTPTL,1)
// ADSTPTH<ADSTPT10>
extern volatile __bit                   ADSTPT10            __at(0x1F02);	// @ (0x3E0 * 8 + 2)
#define                                 ADSTPT10_bit        _BIT_ACCESS(ADSTPTH,2)
// ADSTPTH<ADSTPT11>
extern volatile __bit                   ADSTPT11            __at(0x1F03);	// @ (0x3E0 * 8 + 3)
#define                                 ADSTPT11_bit        _BIT_ACCESS(ADSTPTH,3)
// ADSTPTH<ADSTPT12>
extern volatile __bit                   ADSTPT12            __at(0x1F04);	// @ (0x3E0 * 8 + 4)
#define                                 ADSTPT12_bit        _BIT_ACCESS(ADSTPTH,4)
// ADSTPTH<ADSTPT13>
extern volatile __bit                   ADSTPT13            __at(0x1F05);	// @ (0x3E0 * 8 + 5)
#define                                 ADSTPT13_bit        _BIT_ACCESS(ADSTPTH,5)
// ADSTPTH<ADSTPT14>
extern volatile __bit                   ADSTPT14            __at(0x1F06);	// @ (0x3E0 * 8 + 6)
#define                                 ADSTPT14_bit        _BIT_ACCESS(ADSTPTH,6)
// ADSTPTH<ADSTPT15>
extern volatile __bit                   ADSTPT15            __at(0x1F07);	// @ (0x3E0 * 8 + 7)
#define                                 ADSTPT15_bit        _BIT_ACCESS(ADSTPTH,7)
// ADSTPTL<ADSTPT2>
extern volatile __bit                   ADSTPT2             __at(0x1EFA);	// @ (0x3DF * 8 + 2)
#define                                 ADSTPT2_bit         _BIT_ACCESS(ADSTPTL,2)
// ADSTPTL<ADSTPT3>
extern volatile __bit                   ADSTPT3             __at(0x1EFB);	// @ (0x3DF * 8 + 3)
#define                                 ADSTPT3_bit         _BIT_ACCESS(ADSTPTL,3)
// ADSTPTL<ADSTPT4>
extern volatile __bit                   ADSTPT4             __at(0x1EFC);	// @ (0x3DF * 8 + 4)
#define                                 ADSTPT4_bit         _BIT_ACCESS(ADSTPTL,4)
// ADSTPTL<ADSTPT5>
extern volatile __bit                   ADSTPT5             __at(0x1EFD);	// @ (0x3DF * 8 + 5)
#define                                 ADSTPT5_bit         _BIT_ACCESS(ADSTPTL,5)
// ADSTPTL<ADSTPT6>
extern volatile __bit                   ADSTPT6             __at(0x1EFE);	// @ (0x3DF * 8 + 6)
#define                                 ADSTPT6_bit         _BIT_ACCESS(ADSTPTL,6)
// ADSTPTL<ADSTPT7>
extern volatile __bit                   ADSTPT7             __at(0x1EFF);	// @ (0x3DF * 8 + 7)
#define                                 ADSTPT7_bit         _BIT_ACCESS(ADSTPTL,7)
// ADSTPTH<ADSTPT8>
extern volatile __bit                   ADSTPT8             __at(0x1F00);	// @ (0x3E0 * 8 + 0)
#define                                 ADSTPT8_bit         _BIT_ACCESS(ADSTPTH,0)
// ADSTPTH<ADSTPT9>
extern volatile __bit                   ADSTPT9             __at(0x1F01);	// @ (0x3E0 * 8 + 1)
#define                                 ADSTPT9_bit         _BIT_ACCESS(ADSTPTH,1)
// ADCON3<ADTMD0>
extern volatile __bit                   ADTMD0              __at(0x1FB0);	// @ (0x3F6 * 8 + 0)
#define                                 ADTMD0_bit          _BIT_ACCESS(ADCON3,0)
// ADCON3<ADTMD1>
extern volatile __bit                   ADTMD1              __at(0x1FB1);	// @ (0x3F6 * 8 + 1)
#define                                 ADTMD1_bit          _BIT_ACCESS(ADCON3,1)
// ADCON3<ADTMD2>
extern volatile __bit                   ADTMD2              __at(0x1FB2);	// @ (0x3F6 * 8 + 2)
#define                                 ADTMD2_bit          _BIT_ACCESS(ADCON3,2)
// ADUTHL<ADUTH0>
extern volatile __bit                   ADUTH0              __at(0x1ED8);	// @ (0x3DB * 8 + 0)
#define                                 ADUTH0_bit          _BIT_ACCESS(ADUTHL,0)
// ADUTHL<ADUTH1>
extern volatile __bit                   ADUTH1              __at(0x1ED9);	// @ (0x3DB * 8 + 1)
#define                                 ADUTH1_bit          _BIT_ACCESS(ADUTHL,1)
// ADUTHH<ADUTH10>
extern volatile __bit                   ADUTH10             __at(0x1EE2);	// @ (0x3DC * 8 + 2)
#define                                 ADUTH10_bit         _BIT_ACCESS(ADUTHH,2)
// ADUTHH<ADUTH11>
extern volatile __bit                   ADUTH11             __at(0x1EE3);	// @ (0x3DC * 8 + 3)
#define                                 ADUTH11_bit         _BIT_ACCESS(ADUTHH,3)
// ADUTHH<ADUTH12>
extern volatile __bit                   ADUTH12             __at(0x1EE4);	// @ (0x3DC * 8 + 4)
#define                                 ADUTH12_bit         _BIT_ACCESS(ADUTHH,4)
// ADUTHH<ADUTH13>
extern volatile __bit                   ADUTH13             __at(0x1EE5);	// @ (0x3DC * 8 + 5)
#define                                 ADUTH13_bit         _BIT_ACCESS(ADUTHH,5)
// ADUTHH<ADUTH14>
extern volatile __bit                   ADUTH14             __at(0x1EE6);	// @ (0x3DC * 8 + 6)
#define                                 ADUTH14_bit         _BIT_ACCESS(ADUTHH,6)
// ADUTHH<ADUTH15>
extern volatile __bit                   ADUTH15             __at(0x1EE7);	// @ (0x3DC * 8 + 7)
#define                                 ADUTH15_bit         _BIT_ACCESS(ADUTHH,7)
// ADUTHL<ADUTH2>
extern volatile __bit                   ADUTH2              __at(0x1EDA);	// @ (0x3DB * 8 + 2)
#define                                 ADUTH2_bit          _BIT_ACCESS(ADUTHL,2)
// ADUTHL<ADUTH3>
extern volatile __bit                   ADUTH3              __at(0x1EDB);	// @ (0x3DB * 8 + 3)
#define                                 ADUTH3_bit          _BIT_ACCESS(ADUTHL,3)
// ADUTHL<ADUTH4>
extern volatile __bit                   ADUTH4              __at(0x1EDC);	// @ (0x3DB * 8 + 4)
#define                                 ADUTH4_bit          _BIT_ACCESS(ADUTHL,4)
// ADUTHL<ADUTH5>
extern volatile __bit                   ADUTH5              __at(0x1EDD);	// @ (0x3DB * 8 + 5)
#define                                 ADUTH5_bit          _BIT_ACCESS(ADUTHL,5)
// ADUTHL<ADUTH6>
extern volatile __bit                   ADUTH6              __at(0x1EDE);	// @ (0x3DB * 8 + 6)
#define                                 ADUTH6_bit          _BIT_ACCESS(ADUTHL,6)
// ADUTHL<ADUTH7>
extern volatile __bit                   ADUTH7              __at(0x1EDF);	// @ (0x3DB * 8 + 7)
#define                                 ADUTH7_bit          _BIT_ACCESS(ADUTHL,7)
// ADUTHH<ADUTH8>
extern volatile __bit                   ADUTH8              __at(0x1EE0);	// @ (0x3DC * 8 + 0)
#define                                 ADUTH8_bit          _BIT_ACCESS(ADUTHH,0)
// ADUTHH<ADUTH9>
extern volatile __bit                   ADUTH9              __at(0x1EE1);	// @ (0x3DC * 8 + 1)
#define                                 ADUTH9_bit          _BIT_ACCESS(ADUTHH,1)
// ADSTAT<ADUTHR>
extern volatile __bit                   ADUTHR              __at(0x1FBE);	// @ (0x3F7 * 8 + 6)
#define                                 ADUTHR_bit          _BIT_ACCESS(ADSTAT,6)
// DMAnAIRQ<AIRQ0>
extern volatile __bit                   AIRQ0               __at(0x7F0);	// @ (0xFE * 8 + 0)
#define                                 AIRQ0_bit           _BIT_ACCESS(DMAnAIRQ,0)
// DMAnAIRQ<AIRQ1>
extern volatile __bit                   AIRQ1               __at(0x7F1);	// @ (0xFE * 8 + 1)
#define                                 AIRQ1_bit           _BIT_ACCESS(DMAnAIRQ,1)
// DMAnAIRQ<AIRQ2>
extern volatile __bit                   AIRQ2               __at(0x7F2);	// @ (0xFE * 8 + 2)
#define                                 AIRQ2_bit           _BIT_ACCESS(DMAnAIRQ,2)
// DMAnAIRQ<AIRQ3>
extern volatile __bit                   AIRQ3               __at(0x7F3);	// @ (0xFE * 8 + 3)
#define                                 AIRQ3_bit           _BIT_ACCESS(DMAnAIRQ,3)
// DMAnAIRQ<AIRQ4>
extern volatile __bit                   AIRQ4               __at(0x7F4);	// @ (0xFE * 8 + 4)
#define                                 AIRQ4_bit           _BIT_ACCESS(DMAnAIRQ,4)
// DMAnAIRQ<AIRQ5>
extern volatile __bit                   AIRQ5               __at(0x7F5);	// @ (0xFE * 8 + 5)
#define                                 AIRQ5_bit           _BIT_ACCESS(DMAnAIRQ,5)
// DMAnAIRQ<AIRQ6>
extern volatile __bit                   AIRQ6               __at(0x7F6);	// @ (0xFE * 8 + 6)
#define                                 AIRQ6_bit           _BIT_ACCESS(DMAnAIRQ,6)
// DMAnAIRQ<AIRQ7>
extern volatile __bit                   AIRQ7               __at(0x7F7);	// @ (0xFE * 8 + 7)
#define                                 AIRQ7_bit           _BIT_ACCESS(DMAnAIRQ,7)
// DMAnCON0<AIRQEN>
extern volatile __bit                   AIRQEN              __at(0x7E2);	// @ (0xFC * 8 + 2)
#define                                 AIRQEN_bit          _BIT_ACCESS(DMAnCON0,2)
// ANSELA<ANSELA0>
extern volatile __bit                   ANSELA0             __at(0x2000);	// @ (0x400 * 8 + 0)
#define                                 ANSELA0_bit         _BIT_ACCESS(ANSELA,0)
// ANSELA<ANSELA1>
extern volatile __bit                   ANSELA1             __at(0x2001);	// @ (0x400 * 8 + 1)
#define                                 ANSELA1_bit         _BIT_ACCESS(ANSELA,1)
// ANSELA<ANSELA2>
extern volatile __bit                   ANSELA2             __at(0x2002);	// @ (0x400 * 8 + 2)
#define                                 ANSELA2_bit         _BIT_ACCESS(ANSELA,2)
// ANSELA<ANSELA3>
extern volatile __bit                   ANSELA3             __at(0x2003);	// @ (0x400 * 8 + 3)
#define                                 ANSELA3_bit         _BIT_ACCESS(ANSELA,3)
// ANSELA<ANSELA4>
extern volatile __bit                   ANSELA4             __at(0x2004);	// @ (0x400 * 8 + 4)
#define                                 ANSELA4_bit         _BIT_ACCESS(ANSELA,4)
// ANSELA<ANSELA5>
extern volatile __bit                   ANSELA5             __at(0x2005);	// @ (0x400 * 8 + 5)
#define                                 ANSELA5_bit         _BIT_ACCESS(ANSELA,5)
// ANSELA<ANSELA6>
extern volatile __bit                   ANSELA6             __at(0x2006);	// @ (0x400 * 8 + 6)
#define                                 ANSELA6_bit         _BIT_ACCESS(ANSELA,6)
// ANSELA<ANSELA7>
extern volatile __bit                   ANSELA7             __at(0x2007);	// @ (0x400 * 8 + 7)
#define                                 ANSELA7_bit         _BIT_ACCESS(ANSELA,7)
// ANSELB<ANSELB0>
extern volatile __bit                   ANSELB0             __at(0x2040);	// @ (0x408 * 8 + 0)
#define                                 ANSELB0_bit         _BIT_ACCESS(ANSELB,0)
// ANSELB<ANSELB1>
extern volatile __bit                   ANSELB1             __at(0x2041);	// @ (0x408 * 8 + 1)
#define                                 ANSELB1_bit         _BIT_ACCESS(ANSELB,1)
// ANSELB<ANSELB2>
extern volatile __bit                   ANSELB2             __at(0x2042);	// @ (0x408 * 8 + 2)
#define                                 ANSELB2_bit         _BIT_ACCESS(ANSELB,2)
// ANSELB<ANSELB3>
extern volatile __bit                   ANSELB3             __at(0x2043);	// @ (0x408 * 8 + 3)
#define                                 ANSELB3_bit         _BIT_ACCESS(ANSELB,3)
// ANSELB<ANSELB4>
extern volatile __bit                   ANSELB4             __at(0x2044);	// @ (0x408 * 8 + 4)
#define                                 ANSELB4_bit         _BIT_ACCESS(ANSELB,4)
// ANSELB<ANSELB5>
extern volatile __bit                   ANSELB5             __at(0x2045);	// @ (0x408 * 8 + 5)
#define                                 ANSELB5_bit         _BIT_ACCESS(ANSELB,5)
// ANSELB<ANSELB6>
extern volatile __bit                   ANSELB6             __at(0x2046);	// @ (0x408 * 8 + 6)
#define                                 ANSELB6_bit         _BIT_ACCESS(ANSELB,6)
// ANSELB<ANSELB7>
extern volatile __bit                   ANSELB7             __at(0x2047);	// @ (0x408 * 8 + 7)
#define                                 ANSELB7_bit         _BIT_ACCESS(ANSELB,7)
// ANSELC<ANSELC0>
extern volatile __bit                   ANSELC0             __at(0x2080);	// @ (0x410 * 8 + 0)
#define                                 ANSELC0_bit         _BIT_ACCESS(ANSELC,0)
// ANSELC<ANSELC1>
extern volatile __bit                   ANSELC1             __at(0x2081);	// @ (0x410 * 8 + 1)
#define                                 ANSELC1_bit         _BIT_ACCESS(ANSELC,1)
// ANSELC<ANSELC2>
extern volatile __bit                   ANSELC2             __at(0x2082);	// @ (0x410 * 8 + 2)
#define                                 ANSELC2_bit         _BIT_ACCESS(ANSELC,2)
// ANSELC<ANSELC3>
extern volatile __bit                   ANSELC3             __at(0x2083);	// @ (0x410 * 8 + 3)
#define                                 ANSELC3_bit         _BIT_ACCESS(ANSELC,3)
// ANSELC<ANSELC4>
extern volatile __bit                   ANSELC4             __at(0x2084);	// @ (0x410 * 8 + 4)
#define                                 ANSELC4_bit         _BIT_ACCESS(ANSELC,4)
// ANSELC<ANSELC5>
extern volatile __bit                   ANSELC5             __at(0x2085);	// @ (0x410 * 8 + 5)
#define                                 ANSELC5_bit         _BIT_ACCESS(ANSELC,5)
// ANSELC<ANSELC6>
extern volatile __bit                   ANSELC6             __at(0x2086);	// @ (0x410 * 8 + 6)
#define                                 ANSELC6_bit         _BIT_ACCESS(ANSELC,6)
// ANSELC<ANSELC7>
extern volatile __bit                   ANSELC7             __at(0x2087);	// @ (0x410 * 8 + 7)
#define                                 ANSELC7_bit         _BIT_ACCESS(ANSELC,7)
// ANSELD<ANSELD0>
extern volatile __bit                   ANSELD0             __at(0x20C0);	// @ (0x418 * 8 + 0)
#define                                 ANSELD0_bit         _BIT_ACCESS(ANSELD,0)
// ANSELD<ANSELD1>
extern volatile __bit                   ANSELD1             __at(0x20C1);	// @ (0x418 * 8 + 1)
#define                                 ANSELD1_bit         _BIT_ACCESS(ANSELD,1)
// ANSELD<ANSELD2>
extern volatile __bit                   ANSELD2             __at(0x20C2);	// @ (0x418 * 8 + 2)
#define                                 ANSELD2_bit         _BIT_ACCESS(ANSELD,2)
// ANSELD<ANSELD3>
extern volatile __bit                   ANSELD3             __at(0x20C3);	// @ (0x418 * 8 + 3)
#define                                 ANSELD3_bit         _BIT_ACCESS(ANSELD,3)
// ANSELD<ANSELD4>
extern volatile __bit                   ANSELD4             __at(0x20C4);	// @ (0x418 * 8 + 4)
#define                                 ANSELD4_bit         _BIT_ACCESS(ANSELD,4)
// ANSELD<ANSELD5>
extern volatile __bit                   ANSELD5             __at(0x20C5);	// @ (0x418 * 8 + 5)
#define                                 ANSELD5_bit         _BIT_ACCESS(ANSELD,5)
// ANSELD<ANSELD6>
extern volatile __bit                   ANSELD6             __at(0x20C6);	// @ (0x418 * 8 + 6)
#define                                 ANSELD6_bit         _BIT_ACCESS(ANSELD,6)
// ANSELD<ANSELD7>
extern volatile __bit                   ANSELD7             __at(0x20C7);	// @ (0x418 * 8 + 7)
#define                                 ANSELD7_bit         _BIT_ACCESS(ANSELD,7)
// ANSELE<ANSELE0>
extern volatile __bit                   ANSELE0             __at(0x2100);	// @ (0x420 * 8 + 0)
#define                                 ANSELE0_bit         _BIT_ACCESS(ANSELE,0)
// ANSELE<ANSELE1>
extern volatile __bit                   ANSELE1             __at(0x2101);	// @ (0x420 * 8 + 1)
#define                                 ANSELE1_bit         _BIT_ACCESS(ANSELE,1)
// ANSELE<ANSELE2>
extern volatile __bit                   ANSELE2             __at(0x2102);	// @ (0x420 * 8 + 2)
#define                                 ANSELE2_bit         _BIT_ACCESS(ANSELE,2)
// ANSELF<ANSELF0>
extern volatile __bit                   ANSELF0             __at(0x2140);	// @ (0x428 * 8 + 0)
#define                                 ANSELF0_bit         _BIT_ACCESS(ANSELF,0)
// ANSELF<ANSELF1>
extern volatile __bit                   ANSELF1             __at(0x2141);	// @ (0x428 * 8 + 1)
#define                                 ANSELF1_bit         _BIT_ACCESS(ANSELF,1)
// ANSELF<ANSELF2>
extern volatile __bit                   ANSELF2             __at(0x2142);	// @ (0x428 * 8 + 2)
#define                                 ANSELF2_bit         _BIT_ACCESS(ANSELF,2)
// ANSELF<ANSELF3>
extern volatile __bit                   ANSELF3             __at(0x2143);	// @ (0x428 * 8 + 3)
#define                                 ANSELF3_bit         _BIT_ACCESS(ANSELF,3)
// ANSELF<ANSELF4>
extern volatile __bit                   ANSELF4             __at(0x2144);	// @ (0x428 * 8 + 4)
#define                                 ANSELF4_bit         _BIT_ACCESS(ANSELF,4)
// ANSELF<ANSELF5>
extern volatile __bit                   ANSELF5             __at(0x2145);	// @ (0x428 * 8 + 5)
#define                                 ANSELF5_bit         _BIT_ACCESS(ANSELF,5)
// ANSELF<ANSELF6>
extern volatile __bit                   ANSELF6             __at(0x2146);	// @ (0x428 * 8 + 6)
#define                                 ANSELF6_bit         _BIT_ACCESS(ANSELF,6)
// ANSELF<ANSELF7>
extern volatile __bit                   ANSELF7             __at(0x2147);	// @ (0x428 * 8 + 7)
#define                                 ANSELF7_bit         _BIT_ACCESS(ANSELF,7)
// APMCLK<APMCLK0>
extern volatile __bit                   APMCLK0             __at(0xEC0);	// @ (0x1D8 * 8 + 0)
#define                                 APMCLK0_bit         _BIT_ACCESS(APMCLK,0)
// APMCLK<APMCLK1>
extern volatile __bit                   APMCLK1             __at(0xEC1);	// @ (0x1D8 * 8 + 1)
#define                                 APMCLK1_bit         _BIT_ACCESS(APMCLK,1)
// APMCLKPPS<APMCLKPPS0>
extern volatile __bit                   APMCLKPPS0          __at(0x13D0);	// @ (0x27A * 8 + 0)
#define                                 APMCLKPPS0_bit      _BIT_ACCESS(APMCLKPPS,0)
// APMCLKPPS<APMCLKPPS1>
extern volatile __bit                   APMCLKPPS1          __at(0x13D1);	// @ (0x27A * 8 + 1)
#define                                 APMCLKPPS1_bit      _BIT_ACCESS(APMCLKPPS,1)
// APMCLKPPS<APMCLKPPS2>
extern volatile __bit                   APMCLKPPS2          __at(0x13D2);	// @ (0x27A * 8 + 2)
#define                                 APMCLKPPS2_bit      _BIT_ACCESS(APMCLKPPS,2)
// APMCLKPPS<APMCLKPPS3>
extern volatile __bit                   APMCLKPPS3          __at(0x13D3);	// @ (0x27A * 8 + 3)
#define                                 APMCLKPPS3_bit      _BIT_ACCESS(APMCLKPPS,3)
// APMCLKPPS<APMCLKPPS4>
extern volatile __bit                   APMCLKPPS4          __at(0x13D4);	// @ (0x27A * 8 + 4)
#define                                 APMCLKPPS4_bit      _BIT_ACCESS(APMCLKPPS,4)
// APMCLKPPS<APMCLKPPS5>
extern volatile __bit                   APMCLKPPS5          __at(0x13D5);	// @ (0x27A * 8 + 5)
#define                                 APMCLKPPS5_bit      _BIT_ACCESS(APMCLKPPS,5)
// APMCON<APMEN>
extern volatile __bit                   APMEN               __at(0xE07);	// @ (0x1C0 * 8 + 7)
#define                                 APMEN_bit           _BIT_ACCESS(APMCON,7)
// PMD1<APMMD>
extern volatile __bit                   APMMD               __at(0x31D);	// @ (0x63 * 8 + 5)
#define                                 APMMD_bit           _BIT_ACCESS(PMD1,5)
// APMPERL<APMPER0>
extern volatile __bit                   APMPER0             __at(0xE18);	// @ (0x1C3 * 8 + 0)
#define                                 APMPER0_bit         _BIT_ACCESS(APMPERL,0)
// APMPERL<APMPER1>
extern volatile __bit                   APMPER1             __at(0xE19);	// @ (0x1C3 * 8 + 1)
#define                                 APMPER1_bit         _BIT_ACCESS(APMPERL,1)
// APMPERH<APMPER10>
extern volatile __bit                   APMPER10            __at(0xE22);	// @ (0x1C4 * 8 + 2)
#define                                 APMPER10_bit        _BIT_ACCESS(APMPERH,2)
// APMPERH<APMPER11>
extern volatile __bit                   APMPER11            __at(0xE23);	// @ (0x1C4 * 8 + 3)
#define                                 APMPER11_bit        _BIT_ACCESS(APMPERH,3)
// APMPERH<APMPER12>
extern volatile __bit                   APMPER12            __at(0xE24);	// @ (0x1C4 * 8 + 4)
#define                                 APMPER12_bit        _BIT_ACCESS(APMPERH,4)
// APMPERH<APMPER13>
extern volatile __bit                   APMPER13            __at(0xE25);	// @ (0x1C4 * 8 + 5)
#define                                 APMPER13_bit        _BIT_ACCESS(APMPERH,5)
// APMPERH<APMPER14>
extern volatile __bit                   APMPER14            __at(0xE26);	// @ (0x1C4 * 8 + 6)
#define                                 APMPER14_bit        _BIT_ACCESS(APMPERH,6)
// APMPERH<APMPER15>
extern volatile __bit                   APMPER15            __at(0xE27);	// @ (0x1C4 * 8 + 7)
#define                                 APMPER15_bit        _BIT_ACCESS(APMPERH,7)
// APMPERL<APMPER2>
extern volatile __bit                   APMPER2             __at(0xE1A);	// @ (0x1C3 * 8 + 2)
#define                                 APMPER2_bit         _BIT_ACCESS(APMPERL,2)
// APMPERL<APMPER3>
extern volatile __bit                   APMPER3             __at(0xE1B);	// @ (0x1C3 * 8 + 3)
#define                                 APMPER3_bit         _BIT_ACCESS(APMPERL,3)
// APMPERL<APMPER4>
extern volatile __bit                   APMPER4             __at(0xE1C);	// @ (0x1C3 * 8 + 4)
#define                                 APMPER4_bit         _BIT_ACCESS(APMPERL,4)
// APMPERL<APMPER5>
extern volatile __bit                   APMPER5             __at(0xE1D);	// @ (0x1C3 * 8 + 5)
#define                                 APMPER5_bit         _BIT_ACCESS(APMPERL,5)
// APMPERL<APMPER6>
extern volatile __bit                   APMPER6             __at(0xE1E);	// @ (0x1C3 * 8 + 6)
#define                                 APMPER6_bit         _BIT_ACCESS(APMPERL,6)
// APMPERL<APMPER7>
extern volatile __bit                   APMPER7             __at(0xE1F);	// @ (0x1C3 * 8 + 7)
#define                                 APMPER7_bit         _BIT_ACCESS(APMPERL,7)
// APMPERH<APMPER8>
extern volatile __bit                   APMPER8             __at(0xE20);	// @ (0x1C4 * 8 + 0)
#define                                 APMPER8_bit         _BIT_ACCESS(APMPERH,0)
// APMPERH<APMPER9>
extern volatile __bit                   APMPER9             __at(0xE21);	// @ (0x1C4 * 8 + 1)
#define                                 APMPER9_bit         _BIT_ACCESS(APMPERH,1)
// APMPERE1H<APMPERE1_10>
extern volatile __bit                   APMPERE1_10         __at(0xE92);	// @ (0x1D2 * 8 + 2)
#define                                 APMPERE1_10_bit     _BIT_ACCESS(APMPERE1H,2)
// APMPERE1H<APMPERE1_11>
extern volatile __bit                   APMPERE1_11         __at(0xE93);	// @ (0x1D2 * 8 + 3)
#define                                 APMPERE1_11_bit     _BIT_ACCESS(APMPERE1H,3)
// APMPERE1H<APMPERE1_12>
extern volatile __bit                   APMPERE1_12         __at(0xE94);	// @ (0x1D2 * 8 + 4)
#define                                 APMPERE1_12_bit     _BIT_ACCESS(APMPERE1H,4)
// APMPERE1H<APMPERE1_13>
extern volatile __bit                   APMPERE1_13         __at(0xE95);	// @ (0x1D2 * 8 + 5)
#define                                 APMPERE1_13_bit     _BIT_ACCESS(APMPERE1H,5)
// APMPERE1H<APMPERE1_14>
